{
  "0": "<pad>",
  "1": "<bos>",
  "2": "<eos>",
  "3": "<unk>",
  "4": "abi",
  "5": "ongjok",
  "6": "aganchakani",
  "7": "anga",
  "8": "achak",
  "9": "cha.gen",
  "10": "agan",
  "11": "angna",
  "12": "mai",
  "13": "ong.achim",
  "14": "na.a",
  "15": "dakenga",
  "16": "maiko",
  "17": "kalenga",
  "18": "aganchakani.ara",
  "19": "ong.en",
  "20": "aganjok",
  "21": "aiao",
  "22": "bibal",
  "23": "silade",
  "24": "!",
  "25": "am",
  "26": "name",
  "27": "knatimbo",
  "28": "ama",
  "29": "amak",
  "30": "ambi",
  "31": "amde",
  "32": "dongen",
  "33": "amm",
  "34": "jamano",
  "35": "golpogen",
  "36": "nangna",
  "37": "call",
  "38": "kagen",
  "39": "maming",
  "40": "ongja",
  "41": "masijok",
  "42": "nama",
  "43": "ammde",
  "44": "daoba",
  "45": "talatenga",
  "46": "anchiko",
  "47": "ni.atbo",
  "48": "anching",
  "49": "mi",
  "50": "cha.a",
  "51": "anchingna",
  "52": "ang.a",
  "53": "ia",
  "54": "film",
  "55": "ko",
  "56": "nia",
  "57": "mija",
  "58": "antio",
  "59": "ang.ke",
  "60": "a.palo",
  "61": "achako",
  "62": "golpoenga",
  "63": "golpoa",
  "64": "aro",
  "65": "knatima",
  "66": "antichi",
  "67": "re.angenga",
  "68": "apalchi",
  "69": "arataha",
  "70": "bajalo",
  "71": "bajalona",
  "72": "basakoba",
  "73": "re.bagen",
  "74": "bi.sarangming",
  "75": "kal.a",
  "76": "bilsi",
  "77": "chiking",
  "78": "bol",
  "79": "pang",
  "80": "dao",
  "81": "tusia",
  "82": "chatro",
  "83": "chi",
  "84": "ringa",
  "85": "chitti",
  "86": "sea",
  "87": "chrokenga",
  "88": "da.al",
  "89": "walo",
  "90": "ki.tap",
  "91": "poraigen",
  "92": "chaenga",
  "93": "kam",
  "94": "kaenga",
  "95": "do.o",
  "96": "cha.ana",
  "97": "sikbe.engjok",
  "98": "do.oko",
  "99": "nika",
  "100": "festivalo",
  "101": "chroka",
  "102": "garo",
  "103": "hillo",
  "104": "donga",
  "105": "git",
  "106": "ringen",
  "107": "kinalo",
  "108": "biapo",
  "109": "dong.a",
  "110": "iano",
  "111": "na",
  "112": "re.baa",
  "113": "maikoba",
  "114": "brena",
  "115": "ru.ta",
  "116": "somoionin",
  "117": "dongenga",
  "118": "sakoba",
  "119": "grongna",
  "120": "reba",
  "121": "ja.man",
  "122": "no",
  "123": "jroenga",
  "124": "ka.dinga",
  "125": "grapa",
  "126": "kaam",
  "127": "kalgen",
  "128": "ka.a",
  "129": "neng.taka",
  "130": "kammo",
  "131": "katenga",
  "132": "kata",
  "133": "katchaenga",
  "134": "poraia",
  "135": "chiti",
  "136": "chokgen",
  "137": "chrokgen",
  "138": "katgen",
  "139": "kna.a",
  "140": "knaenga",
  "141": "nanga",
  "142": "mamingba",
  "143": "dakjaenga",
  "144": "mande",
  "145": "masija",
  "146": "iako",
  "147": "me.su",
  "148": "samjakrangko",
  "149": "meghalayao",
  "150": "songdonga",
  "151": "cha",
  "152": "enga",
  "153": "miakoba",
  "154": "ramramgipako",
  "155": "mijal",
  "156": "seaha",
  "157": "poraiaha",
  "158": "mijalo",
  "159": "kal.aha",
  "160": "schoolchi",
  "161": "rama",
  "162": "re.angaha",
  "163": "mirongko",
  "164": "nangko",
  "165": "aganenga",
  "166": "kasa",
  "167": "neng.take",
  "168": "nienga",
  "169": "nokchi",
  "170": "re.anga",
  "171": "noko",
  "172": "noksa",
  "173": "salenga",
  "174": "ontisa",
  "175": "somoioni",
  "176": "poraienga",
  "177": "re.a",
  "178": "reenga",
  "179": "ringenga",
  "180": "rongchi",
  "181": "rongtalatenga",
  "182": "sawa",
  "183": "schoolona",
  "184": "seaenga",
  "185": "sengsoenga",
  "186": "skie",
  "187": "raenga",
  "188": "skigipa",
  "189": "songenga",
  "190": "ta.rake",
  "191": "ta.raken",
  "192": "re.bapilgen",
  "193": "tale",
  "194": "agangen",
  "195": "tusienga",
  "196": "tusigen",
  "197": "tusina",
  "198": "tv",
  "199": "nie",
  "200": "ming",
  "201": "walni",
  "202": "ringaha",
  "203": "angaba",
  "204": "namenga",
  "205": "angade",
  "206": "kramchi",
  "207": "rarajok",
  "208": "okrienga",
  "209": "angchina",
  "210": "nibo",
  "211": "angko",
  "212": "dak.chakanina",
  "213": "mitela",
  "214": "dakchakbo",
  "215": "kema",
  "216": "ka.bo",
  "217": "ka.pabo",
  "218": "rohit",
  "219": "minga",
  "220": "kabo",
  "221": "re.bajoko",
  "222": "dakchakna",
  "223": "mangenma",
  "224": "namen",
  "225": "khashabo",
  "226": "nangja",
  "227": "onbo",
  "228": "angni",
  "229": "biming",
  "230": "marak",
  "231": "biminga",
  "232": "bokma",
  "233": "mikuengjok",
  "234": "okrieming",
  "235": "botol",
  "236": "angnin",
  "237": "gualani",
  "238": "ong.a",
  "239": "ango",
  "240": "ka.ani",
  "241": "nengnikani",
  "242": "asong",
  "243": "asongenga",
  "244": "asongbo",
  "245": "atchiata",
  "246": "atchu",
  "247": "attamnam",
  "248": "awang",
  "249": "baba",
  "250": "bachi",
  "251": "maidake",
  "252": "doarang",
  "253": "bilangenga",
  "254": "?",
  "255": "bachina",
  "256": "chiringni",
  "257": "jokaenga",
  "258": "badia",
  "259": "bite",
  "260": "chibata",
  "261": "rubata",
  "262": "ki.tapko",
  "263": "nangni",
  "264": "badita",
  "265": "badiya",
  "266": "golpo",
  "267": "agana",
  "268": "baita",
  "269": "cha.ani",
  "270": "dongkuenga",
  "271": "nokrang",
  "272": "songadamo",
  "273": "bajal",
  "274": "bakos",
  "275": "ning.ao",
  "276": "banga",
  "277": "bano",
  "278": "basako",
  "279": "chagen",
  "280": "bisarang",
  "281": "jajong",
  "282": "nadogen",
  "283": "kadinga",
  "284": "basakoni",
  "285": "bia",
  "286": "apple",
  "287": "cha.aha",
  "288": "bus",
  "289": "o",
  "290": "reba.a",
  "291": "chamanjok",
  "292": "walgimik",
  "293": "tua",
  "294": "bigil",
  "295": "bisong",
  "296": "olakiramchi",
  "297": "cha.ha",
  "298": "chabi",
  "299": "chabo",
  "300": "chakat",
  "301": "chakatbo",
  "302": "chakatjok",
  "303": "chinga",
  "304": "chingna",
  "305": "chingo",
  "306": "chona",
  "307": "chongipa",
  "308": "dada",
  "309": "daka",
  "310": "dal.a",
  "311": "dalgipa",
  "312": "dambe",
  "313": "me.chik",
  "314": "pante",
  "315": "tai",
  "316": "talatbo",
  "317": "daon",
  "318": "dakat",
  "319": "de",
  "320": "bye",
  "321": "dongbo",
  "322": "dingbea",
  "323": "da.asalde",
  "324": "do.bok",
  "325": "gada",
  "326": "gen",
  "327": "gingting",
  "328": "gitok",
  "329": "gondu",
  "330": "gora",
  "331": "hai",
  "332": "apsan",
  "333": "re.na",
  "334": "indide",
  "335": "hey",
  "336": "hi",
  "337": "hoe",
  "338": "busy",
  "339": "cha.jok",
  "340": "mangenba",
  "341": "katta",
  "342": "knae",
  "343": "kusi",
  "344": "ihing",
  "345": "masijaha",
  "346": "manjawa",
  "347": "kakuja",
  "348": "namja",
  "349": "indiba",
  "350": "indita",
  "351": "ja.a",
  "352": "ja.ping",
  "353": "ja.sku",
  "354": "dema",
  "355": "jachok",
  "356": "jajrengnabe",
  "357": "jak",
  "358": "jakpa",
  "359": "jakpong",
  "360": "jaksi",
  "361": "jaksirang",
  "362": "jakskil",
  "363": "nangming",
  "364": "janggil",
  "365": "jegita",
  "366": "jisuna",
  "367": "rasong",
  "368": "jojong",
  "369": "jumang",
  "370": "ka.bak",
  "371": "ka.sa",
  "372": "ka.saenga",
  "373": "ka.sapae",
  "374": "ianona",
  "375": "re.babo",
  "376": "kang.kare",
  "377": "kasapae",
  "378": "kasine",
  "379": "khuliaha",
  "380": "khulibo",
  "381": "khuligen",
  "382": "ki.sangchi",
  "383": "ki.singkop",
  "384": "nigen",
  "385": "re.angen",
  "386": "kni",
  "387": "ku.chil",
  "388": "ku.dipe",
  "389": "ku.sik",
  "390": "ku.simang",
  "391": "ma.a",
  "392": "paa",
  "393": "rang",
  "394": "neng.nikani",
  "395": "ongenga",
  "396": "classroomo",
  "397": "somoi",
  "398": "doa",
  "399": "somoio",
  "400": "sal",
  "401": "napgen",
  "402": "maia",
  "403": "maina",
  "404": "cha.na",
  "405": "man.a",
  "406": "uamang",
  "407": "lekao",
  "408": "chokga",
  "409": "chanchienga",
  "410": "miksonga",
  "411": "askirang",
  "412": "chingenga",
  "413": "mango",
  "414": "mama",
  "415": "man.gen",
  "416": "mani",
  "417": "marong",
  "418": "masia",
  "419": "masu",
  "420": "matcha",
  "421": "matchapeng",
  "422": "matchok",
  "423": "matchu",
  "424": "dobok",
  "425": "matma",
  "426": "menggo",
  "427": "mengotchi",
  "428": "mes",
  "429": "kataha",
  "430": "mikkang",
  "431": "mikron",
  "432": "miksram",
  "433": "mongma",
  "434": "n.a",
  "435": "a",
  "436": "batchi",
  "437": "re",
  "438": "amenga",
  "439": ".",
  "440": "dakgen",
  "441": "man",
  "442": "genma",
  "443": "masiama",
  "444": "senggen",
  "445": "ma",
  "446": "bisarangming",
  "447": "ka.la",
  "448": "angana",
  "449": "man.ama",
  "450": "iachi",
  "451": "rebabo",
  "452": "sal.a",
  "453": "miksonge",
  "454": "masiaha",
  "455": "chajokma",
  "456": "pen",
  "457": "on.a",
  "458": "rake",
  "459": "re.baengama",
  "460": "rebagen",
  "461": "rebana",
  "462": "mangen",
  "463": "sigen",
  "464": "uachi",
  "465": "na.aba",
  "466": "ang",
  "467": "baksa",
  "468": "repagenma",
  "469": "na.ara",
  "470": "janggi",
  "471": "tang.ao",
  "472": "kamko",
  "473": "ka.na",
  "474": "namengama",
  "475": "nachil",
  "476": "dake",
  "477": "poraibo",
  "478": "poariabo",
  "479": "namengaba",
  "480": ",",
  "481": "nang",
  "482": "babani",
  "483": "bimingko",
  "484": "namnikgipa",
  "485": "rong.ara",
  "486": "mai.a",
  "487": "gronge",
  "488": "namnik.aha",
  "489": "mitelbejok",
  "490": "namgipa",
  "491": "ong.china",
  "492": "nangnin",
  "493": "nok",
  "494": "nono",
  "495": "oh",
  "496": "olakiram",
  "497": "free",
  "498": "pringnam",
  "499": "ra",
  "500": "rabo",
  "501": "raka",
  "502": "rea",
  "503": "re.ang",
  "504": "reangen",
  "505": "reba.aha",
  "506": "rebo",
  "507": "ringbo",
  "508": "rimchaksoa",
  "509": "ripeng",
  "510": "ripengrang",
  "511": "ro.ong",
  "512": "ruenga",
  "513": "rua",
  "514": "saljatchi",
  "515": "nam",
  "516": "salnam",
  "517": "sani",
  "518": "juttarang",
  "519": "angara",
  "520": "rebaenga",
  "521": "chairo",
  "522": "sengbo",
  "523": "silchidare",
  "524": "ska",
  "525": "so.oma",
  "526": "song.a",
  "527": "sre",
  "528": "talat",
  "529": "teka",
  "530": "tusibo",
  "531": "re.angbo",
  "532": "ua",
  "533": "uko",
  "534": "chaa",
  "535": "rae",
  "536": "iyangbo",
  "537": "wagam",
  "538": "wak",
  "539": "walnam",
  "540": "songbad",
  "541": "gitrang",
  "542": "mipring",
  "543": "office",
  "544": "songa",
  "545": "english",
  "546": "ra.a",
  "547": "hindi",
  "548": "te.gatchu",
  "549": "namnika",
  "550": "ugitan",
  "551": "namenika",
  "552": "epil",
  "553": "terik",
  "554": "draka",
  "555": "narang",
  "556": "kompiram",
  "557": "robol",
  "558": "hockey",
  "559": "badminton",
  "560": "kal.inga",
  "561": "volleyball",
  "562": "kabaddi",
  "563": "basketball",
  "564": "ki.taprang",
  "565": "poedo",
  "566": "segipa",
  "567": "porai.ga",
  "568": "poraia.ga",
  "569": "novels",
  "570": "megazines",
  "571": "articles",
  "572": "homework",
  "573": "sea.ga",
  "574": "notes",
  "575": "essay",
  "576": "reports",
  "577": "assignments",
  "578": "project",
  "579": "ku.agana",
  "580": "gam.bea",
  "581": "gam.bee",
  "582": "aganinga",
  "583": "rinoke",
  "584": "ku.aganinga",
  "585": "rongtala",
  "586": "rongtale",
  "587": "ka.sae",
  "588": "bike",
  "589": "gari",
  "590": "kolom",
  "591": "ra.enga",
  "592": "hajok",
  "593": "ianon",
  "594": "dong.enga",
  "595": "porai.enga",
  "596": "seng.enga",
  "597": "ka.enga",
  "598": "okam",
  "599": "okamatjok",
  "600": "okam.enga",
  "601": "biko",
  "602": "matchota",
  "603": "matchotatjok",
  "604": "bon.ata",
  "605": "bon.atjok",
  "606": "kobor",
  "607": "knaaha",
  "608": "ra.jok",
  "609": "tangka",
  "610": "nikaha",
  "611": "sakgni",
  "612": "delhi",
  "613": "sokba.aha",
  "614": "sokbaa",
  "615": "skanga",
  "616": "grongaha",
  "617": "gronga",
  "618": "matchotataha",
  "619": "ra.aha",
  "620": "sokang.aha",
  "621": "phoneko",
  "622": "charge",
  "623": "ka.aha",
  "624": "homeworkko",
  "625": "bino",
  "626": "uamango",
  "627": "mirong",
  "628": "nokdang",
  "629": "jakra",
  "630": "jakgasi",
  "631": "kosak",
  "632": "kama",
  "633": "mikang",
  "634": "kisang",
  "635": "mitchia",
  "636": "gisik",
  "637": "skang",
  "638": "kae",
  "639": "ha",
  "640": "jaman",
  "641": "re.angno",
  "642": "reba.gen",
  "643": "bini",
  "644": "uamangni",
  "645": "darangoba",
  "646": "kadongja",
  "647": "nitat.enga",
  "648": "nitat.a",
  "649": "saloba",
  "650": "golpojawa",
  "651": "golpowa",
  "652": "jamani",
  "653": "sikkimgen",
  "654": "uchi",
  "655": "rena",
  "656": "onggija",
  "657": "grapenga",
  "658": "changsao",
  "659": "budepa",
  "660": "butchuma",
  "661": "measarang",
  "662": "mechiksarang",
  "663": "measa",
  "664": "mechiksa",
  "665": "gital",
  "666": "guiter",
  "667": "bajai.ga",
  "668": "sa",
  "669": "gni",
  "670": "gitam",
  "671": "bri",
  "672": "bonga",
  "673": "dok",
  "674": "sni",
  "675": "chet",
  "676": "sku",
  "677": "chikking",
  "678": "chisa",
  "679": "chigni",
  "680": "chigitam",
  "681": "chibri",
  "682": "chibonga",
  "683": "chidok",
  "684": "chisni",
  "685": "chichet",
  "686": "chisku",
  "687": "kolgrik",
  "688": "kolachi",
  "689": "sotbri",
  "690": "sotbonga",
  "691": "sotdok",
  "692": "sotsni",
  "693": "sotchet",
  "694": "sotsku",
  "695": "richasa",
  "696": "richagni",
  "697": "richagitam",
  "698": "richabri",
  "699": "richabonga",
  "700": "richadok",
  "701": "richasni",
  "702": "richachet",
  "703": "richasku",
  "704": "lakhsa"
}