{
  "0": "<pad>",
  "1": "<bos>",
  "2": "<eos>",
  "3": "<unk>",
  "4": "abi",
  "5": "ongjok",
  "6": "aganchakani",
  "7": "anga",
  "8": "achak",
  "9": "cha.gen",
  "10": "agan",
  "11": "angna",
  "12": "mai",
  "13": "ong.achim",
  "14": "na.a",
  "15": "dak.enga",
  "16": "maiko",
  "17": "kal.enga",
  "18": "agana",
  "19": "aganchakani.ara",
  "20": "ong.en",
  "21": "aganjok",
  "22": "aiao",
  "23": "bibal",
  "24": "silade",
  "25": "!",
  "26": "am",
  "27": "name",
  "28": "knatimbo",
  "29": "ama",
  "30": "amak",
  "31": "ambi",
  "32": "amde",
  "33": "dongen",
  "34": "amm",
  "35": "jamano",
  "36": "golpogen",
  "37": "nangna",
  "38": "call",
  "39": "kagen",
  "40": "maming",
  "41": "ongja",
  "42": "masijok",
  "43": "nama",
  "44": "ammde",
  "45": "daoba",
  "46": "talatenga",
  "47": "anchiko",
  "48": "ni.atbo",
  "49": "anching",
  "50": "mi",
  "51": "cha.a",
  "52": "anchingna",
  "53": "ang.a",
  "54": "ia",
  "55": "film",
  "56": "ko",
  "57": "nia",
  "58": "mija",
  "59": "antio",
  "60": "ang.ke",
  "61": "a.palo",
  "62": "achako",
  "63": "agan.enga",
  "64": "aro",
  "65": "knatima",
  "66": "antichi",
  "67": "re.angenga",
  "68": "apalchi",
  "69": "arataha",
  "70": "bajalo",
  "71": "bajalona",
  "72": "basakoba",
  "73": "re.bagen",
  "74": "bi.sarangming",
  "75": "kal.a",
  "76": "bilsi",
  "77": "chiking",
  "78": "bol",
  "79": "pang",
  "80": "dao",
  "81": "tusia",
  "82": "chatro",
  "83": "chi",
  "84": "ringa",
  "85": "chitti",
  "86": "sea",
  "87": "chrok.enga",
  "88": "da.al",
  "89": "walo",
  "90": "ki.tap",
  "91": "poraigen",
  "92": "cha.enga",
  "93": "kam",
  "94": "ka.enga",
  "95": "do.o",
  "96": "cha.ana",
  "97": "sikbe.engjok",
  "98": "do.oko",
  "99": "nika",
  "100": "festivalo",
  "101": "chroka",
  "102": "garo",
  "103": "hillo",
  "104": "donga",
  "105": "git",
  "106": "ringen",
  "107": "kinalo",
  "108": "biapo",
  "109": "dong.a",
  "110": "iano",
  "111": "na",
  "112": "re.baa",
  "113": "maikoba",
  "114": "brena",
  "115": "ru.ta",
  "116": "somoionin",
  "117": "dong.enga",
  "118": "sakoba",
  "119": "grongna",
  "120": "reba",
  "121": "ja.man",
  "122": "no",
  "123": "jro.enga",
  "124": "ka.dinga",
  "125": "grapa",
  "126": "kaam",
  "127": "kalgen",
  "128": "ka.a",
  "129": "neng.taka",
  "130": "kammo",
  "131": "kat.enga",
  "132": "kata",
  "133": "katchaenga",
  "134": "poraia",
  "135": "chiti",
  "136": "chokgen",
  "137": "chrokgen",
  "138": "katgen",
  "139": "kna.a",
  "140": "kna.enga",
  "141": "nanga",
  "142": "mamingba",
  "143": "dakja.enga",
  "144": "mande",
  "145": "masija",
  "146": "iako",
  "147": "me.su",
  "148": "samjakrangko",
  "149": "meghalayao",
  "150": "songdonga",
  "151": "cha",
  "152": "enga",
  "153": "miakoba",
  "154": "ramramgipako",
  "155": "mijal",
  "156": "seaha",
  "157": "poraiaha",
  "158": "mijalo",
  "159": "kal.aha",
  "160": "schoolchi",
  "161": "rama",
  "162": "re.angaha",
  "163": "mirongko",
  "164": "nangko",
  "165": "kasa",
  "166": "neng.take",
  "167": "ni.enga",
  "168": "nokchi",
  "169": "re.anga",
  "170": "noko",
  "171": "noksa",
  "172": "sal.enga",
  "173": "okkrienga",
  "174": "ontisa",
  "175": "somoioni",
  "176": "porai.enga",
  "177": "re.a",
  "178": "re.enga",
  "179": "ring.enga",
  "180": "rongchi",
  "181": "rongtalat.enga",
  "182": "sawa",
  "183": "schoolona",
  "184": "sea.enga",
  "185": "sengso.enga",
  "186": "skie",
  "187": "ra.enga",
  "188": "skigipa",
  "189": "song.enga",
  "190": "ta.rake",
  "191": "ta.raken",
  "192": "re.bapilgen",
  "193": "tale",
  "194": "agangen",
  "195": "tusi.enga",
  "196": "tusigen",
  "197": "tusina",
  "198": "tv",
  "199": "nie",
  "200": "ming",
  "201": "walni",
  "202": "ringaha",
  "203": "angaba",
  "204": "namenga",
  "205": "angade",
  "206": "kramchi",
  "207": "rarajok",
  "208": "okrienga",
  "209": "angchina",
  "210": "nibo",
  "211": "angko",
  "212": "dak.chakanina",
  "213": "mitela",
  "214": "dakchakbo",
  "215": "kema",
  "216": "ka.bo",
  "217": "ka.pabo",
  "218": "rohit",
  "219": "minga",
  "220": "kabo",
  "221": "re.bajoko",
  "222": "dakchakna",
  "223": "mangenma",
  "224": "namen",
  "225": "khashabo",
  "226": "nangja",
  "227": "onbo",
  "228": "angni",
  "229": "biming",
  "230": "marak",
  "231": "biminga",
  "232": "bokma",
  "233": "mikuengjok",
  "234": "okrieming",
  "235": "botol",
  "236": "angnin",
  "237": "gualani",
  "238": "ong.a",
  "239": "ango",
  "240": "ka.ani",
  "241": "nengnikani",
  "242": "asong",
  "243": "asong.enga",
  "244": "asongbo",
  "245": "atchiata",
  "246": "atchu",
  "247": "attamnam",
  "248": "awang",
  "249": "baba",
  "250": "bachi",
  "251": "maidake",
  "252": "doarang",
  "253": "bilang.enga",
  "254": "?",
  "255": "bachina",
  "256": "chiringni",
  "257": "joka.enga",
  "258": "badia",
  "259": "bite",
  "260": "chibata",
  "261": "rubata",
  "262": "poraienga",
  "263": "ki.tapko",
  "264": "nangni",
  "265": "badita",
  "266": "badiya",
  "267": "golpo",
  "268": "baita",
  "269": "cha.ani",
  "270": "dongku.enga",
  "271": "nokrang",
  "272": "songadamo",
  "273": "bajal",
  "274": "bakos",
  "275": "ning.ao",
  "276": "banga",
  "277": "bano",
  "278": "basako",
  "279": "chagen",
  "280": "bisarang",
  "281": "jajong",
  "282": "nadogen",
  "283": "kadinga",
  "284": "basakoni",
  "285": "bia",
  "286": "apple",
  "287": "cha.aha",
  "288": "bus",
  "289": "o",
  "290": "reba.a",
  "291": "chamanjok",
  "292": "walgimik",
  "293": "tua",
  "294": "bigil",
  "295": "bisong",
  "296": "olakiramchi",
  "297": ".",
  "298": "cha.ha",
  "299": "chabi",
  "300": "chabo",
  "301": "chakat",
  "302": "chakatbo",
  "303": "chakatjok",
  "304": "chinga",
  "305": "chingna",
  "306": "chingo",
  "307": "chona",
  "308": "chongipa",
  "309": "dada",
  "310": "daka",
  "311": "dakenga",
  "312": "dal.a",
  "313": "dalgipa",
  "314": "dambe",
  "315": "me.chik",
  "316": "pante",
  "317": "tai",
  "318": "talatbo",
  "319": "daon",
  "320": "dakat",
  "321": "de",
  "322": "bye",
  "323": "dongbo",
  "324": "dingbea",
  "325": "da.asalde",
  "326": "do.bok",
  "327": "gada",
  "328": "gen",
  "329": "gingting",
  "330": "gitok",
  "331": "gondu",
  "332": "gora",
  "333": "hai",
  "334": "apsan",
  "335": "re.na",
  "336": "indide",
  "337": "hey",
  "338": "hi",
  "339": "hoe",
  "340": "busy",
  "341": "cha.jok",
  "342": "mangenba",
  "343": "katta",
  "344": "knae",
  "345": "kusi",
  "346": "ihing",
  "347": "masijaha",
  "348": "manjawa",
  "349": "kakuja",
  "350": "namja",
  "351": "indiba",
  "352": "indita",
  "353": "ja.a",
  "354": "ja.ping",
  "355": "ja.sku",
  "356": "dema",
  "357": "jachok",
  "358": "jajrengnabe",
  "359": "jak",
  "360": "jakpa",
  "361": "jakpong",
  "362": "jaksi",
  "363": "jaksirang",
  "364": "jakskil",
  "365": "nangming",
  "366": "janggil",
  "367": "jegita",
  "368": "jisuna",
  "369": "rasong",
  "370": "jojong",
  "371": "jumang",
  "372": "ka.bak",
  "373": "ka.sa",
  "374": "ka.saenga",
  "375": "ka.sapae",
  "376": "ianona",
  "377": "re.babo",
  "378": "kang.kare",
  "379": "kasapae",
  "380": "kasine",
  "381": "khuliaha",
  "382": "khulibo",
  "383": "khuligen",
  "384": "ki.sangchi",
  "385": "ki.singkop",
  "386": "nigen",
  "387": "re.angen",
  "388": "kni",
  "389": "ku.chil",
  "390": "ku.dipe",
  "391": "ku.sik",
  "392": "ku.simang",
  "393": "ma.a",
  "394": "paa",
  "395": "rang",
  "396": "neng.nikani",
  "397": "ong.enga",
  "398": "classroomo",
  "399": "somoi",
  "400": "ongenga",
  "401": "doa",
  "402": "somoio",
  "403": "sal",
  "404": "napgen",
  "405": "maia",
  "406": "maina",
  "407": "cha.na",
  "408": "man.a",
  "409": "uamang",
  "410": "lekao",
  "411": "chokga",
  "412": "chanchi.enga",
  "413": "miksonga",
  "414": "askirang",
  "415": "ching.enga",
  "416": "mango",
  "417": "tusienga",
  "418": "mama",
  "419": "man.gen",
  "420": "mani",
  "421": "marong",
  "422": "masia",
  "423": "masu",
  "424": "matcha",
  "425": "matchapeng",
  "426": "matchok",
  "427": "matchu",
  "428": "dobok",
  "429": "matma",
  "430": "menggo",
  "431": "mengotchi",
  "432": "mes",
  "433": "kataha",
  "434": "mikkang",
  "435": "mikron",
  "436": "miksram",
  "437": "mongma",
  "438": "n.a",
  "439": "a",
  "440": "batchi",
  "441": "re",
  "442": "amenga",
  "443": "dakgen",
  "444": "man",
  "445": "genma",
  "446": "masiama",
  "447": "senggen",
  "448": "ma",
  "449": "bisarangming",
  "450": "ka.la",
  "451": "angana",
  "452": "man.ama",
  "453": "iachi",
  "454": "rebabo",
  "455": "sal.a",
  "456": "miksonge",
  "457": "aganenga",
  "458": "masiaha",
  "459": "chajokma",
  "460": "pen",
  "461": "on.a",
  "462": "rake",
  "463": "re.baengama",
  "464": "rebagen",
  "465": "rebana",
  "466": "mangen",
  "467": "sigen",
  "468": "uachi",
  "469": "na.aba",
  "470": "ang",
  "471": "baksa",
  "472": "repagenma",
  "473": "na.ara",
  "474": "janggi",
  "475": "tang.ao",
  "476": "kamko",
  "477": "ka.na",
  "478": "namengama",
  "479": "nachil",
  "480": "dake",
  "481": "poraibo",
  "482": "poariabo",
  "483": "namengaba",
  "484": ",",
  "485": "nang",
  "486": "babani",
  "487": "bimingko",
  "488": "namnikgipa",
  "489": "rong.ara",
  "490": "mai.a",
  "491": "gronge",
  "492": "namnik.aha",
  "493": "mitelbejok",
  "494": "namgipa",
  "495": "ong.china",
  "496": "nangnin",
  "497": "nok",
  "498": "nono",
  "499": "oh",
  "500": "olakiram",
  "501": "free",
  "502": "pringnam",
  "503": "ra",
  "504": "rabo",
  "505": "raka",
  "506": "rea",
  "507": "re.ang",
  "508": "reangen",
  "509": "reba.aha",
  "510": "rebo",
  "511": "ringbo",
  "512": "rimchaksoa",
  "513": "ripeng",
  "514": "ripengrang",
  "515": "ro.ong",
  "516": "ru.enga",
  "517": "rua",
  "518": "saljatchi",
  "519": "nam",
  "520": "salnam",
  "521": "sani",
  "522": "juttarang",
  "523": "angara",
  "524": "reba.enga",
  "525": "chairo",
  "526": "asongenga",
  "527": "sengbo",
  "528": "silchidare",
  "529": "ska",
  "530": "so.oma",
  "531": "song.a",
  "532": "sre",
  "533": "talat",
  "534": "teka",
  "535": "tusibo",
  "536": "re.angbo",
  "537": "ua",
  "538": "uko",
  "539": "rae",
  "540": "iyangbo",
  "541": "wagam",
  "542": "wak",
  "543": "walnam",
  "544": "songbad",
  "545": "gitrang",
  "546": "mipring",
  "547": "office",
  "548": "songa",
  "549": "english",
  "550": "ra.a",
  "551": "hindi",
  "552": "te.gatchu",
  "553": "namnika",
  "554": "ugitan",
  "555": "namenika",
  "556": "epil",
  "557": "terik",
  "558": "draka",
  "559": "narang",
  "560": "kompiram",
  "561": "robol",
  "562": "hockey",
  "563": "badminton",
  "564": "kal.inga",
  "565": "volleyball",
  "566": "kabaddi",
  "567": "basketball",
  "568": "ki.taprang",
  "569": "poedo",
  "570": "segipa",
  "571": "porai.ga",
  "572": "poraia.ga",
  "573": "novels",
  "574": "megazines",
  "575": "articles",
  "576": "homework",
  "577": "sea.ga",
  "578": "notes",
  "579": "essay",
  "580": "reports",
  "581": "assignments",
  "582": "project",
  "583": "ku.agana",
  "584": "gam.bea",
  "585": "gam.bee",
  "586": "aganinga",
  "587": "rinoke",
  "588": "ku.aganinga",
  "589": "rongtala",
  "590": "rongtale",
  "591": "ka.sae",
  "592": "bike",
  "593": "gari",
  "594": "kolom",
  "595": "hajok",
  "596": "ianon",
  "597": "seng.enga",
  "598": "okam",
  "599": "okamatjok",
  "600": "okam.enga",
  "601": "biko",
  "602": "matchota",
  "603": "matchotatjok",
  "604": "bon.ata",
  "605": "bon.atjok",
  "606": "kobor",
  "607": "knaaha",
  "608": "ra.jok",
  "609": "tangka",
  "610": "nikaha",
  "611": "sakgni",
  "612": "delhi",
  "613": "sokba.aha",
  "614": "sokbaa",
  "615": "skanga",
  "616": "grongaha",
  "617": "gronga",
  "618": "matchotataha",
  "619": "ra.aha",
  "620": "sokang.aha",
  "621": "phoneko",
  "622": "charge",
  "623": "ka.aha",
  "624": "homeworkko",
  "625": "bino",
  "626": "uamango",
  "627": "mirong",
  "628": "nokdang",
  "629": "jakra",
  "630": "jakgasi",
  "631": "kosak",
  "632": "kama",
  "633": "mikang",
  "634": "kisang",
  "635": "mitchia",
  "636": "gisik",
  "637": "skang",
  "638": "kae",
  "639": "ha",
  "640": "jaman",
  "641": "re.angno",
  "642": "reba.gen"
}