{
  "0": "<pad>",
  "1": "<bos>",
  "2": "<eos>",
  "3": "<unk>",
  "4": "abi",
  "5": "ongjok",
  "6": "aganchakani",
  "7": "anga",
  "8": "achak",
  "9": "cha.gen",
  "10": "agan",
  "11": "angna",
  "12": "mai",
  "13": "ong.achim",
  "14": "na.a",
  "15": "dak.enga",
  "16": "maiko",
  "17": "kal.enga",
  "18": "agana",
  "19": "aganchakani.ara",
  "20": "ong.en",
  "21": "aganjok",
  "22": "aiao",
  "23": "bibal",
  "24": "silade",
  "25": "!",
  "26": "am",
  "27": "name",
  "28": "knatimbo",
  "29": "ama",
  "30": "amak",
  "31": "ambi",
  "32": "amde",
  "33": "dongen",
  "34": "amm",
  "35": "jamano",
  "36": "golpogen",
  "37": "nangna",
  "38": "call",
  "39": "kagen",
  "40": "maming",
  "41": "ongja",
  "42": "masijok",
  "43": "nama",
  "44": "ammde",
  "45": "daoba",
  "46": "talatenga",
  "47": "anchiko",
  "48": "ni.atbo",
  "49": "anching",
  "50": "mi",
  "51": "cha.a",
  "52": "anchingna",
  "53": "ang.a",
  "54": "ia",
  "55": "film",
  "56": "ko",
  "57": "nia",
  "58": "mija",
  "59": "antio",
  "60": "ang.ke",
  "61": "a.palo",
  "62": "achako",
  "63": "agan.enga",
  "64": "aro",
  "65": "knatima",
  "66": "antichi",
  "67": "re.angenga",
  "68": "apalchi",
  "69": "arataha",
  "70": "bajalo",
  "71": "bajalona",
  "72": "basakoba",
  "73": "re.bagen",
  "74": "bi.sarangming",
  "75": "kal.a",
  "76": "bilsi",
  "77": "chiking",
  "78": "bol",
  "79": "pang",
  "80": "dao",
  "81": "tusia",
  "82": "chatro",
  "83": "chi",
  "84": "ringa",
  "85": "chitti",
  "86": "sea",
  "87": "chrok.enga",
  "88": "da.al",
  "89": "walo",
  "90": "ki.tap",
  "91": "poraigen",
  "92": "cha.enga",
  "93": "kam",
  "94": "ka.enga",
  "95": "do.o",
  "96": "cha.ana",
  "97": "sikbe.engjok",
  "98": "do.oko",
  "99": "nika",
  "100": "festivalo",
  "101": "chroka",
  "102": "garo",
  "103": "hillo",
  "104": "donga",
  "105": "git",
  "106": "ringen",
  "107": "kinalo",
  "108": "biapo",
  "109": "dong.a",
  "110": "iano",
  "111": "na",
  "112": "re.baa",
  "113": "maikoba",
  "114": "brena",
  "115": "ru.ta",
  "116": "somoionin",
  "117": "dong.enga",
  "118": "sakoba",
  "119": "grongna",
  "120": "reba",
  "121": "ja.man",
  "122": "no",
  "123": "jro.enga",
  "124": "ka.dinga",
  "125": "grapa",
  "126": "kaam",
  "127": "kalgen",
  "128": "ka.a",
  "129": "neng.taka",
  "130": "kammo",
  "131": "kat.enga",
  "132": "kata",
  "133": "kusi",
  "134": "ong.a",
  "135": "poraia",
  "136": "chiti",
  "137": "chokgen",
  "138": "chrokgen",
  "139": "katgen",
  "140": "kna.a",
  "141": "kna.enga",
  "142": "nanga",
  "143": "mamingba",
  "144": "dakja.enga",
  "145": "mande",
  "146": "masija",
  "147": "iako",
  "148": "me.su",
  "149": "samjakrangko",
  "150": "meghalayao",
  "151": "songdonga",
  "152": "cha",
  "153": "enga",
  "154": "miakoba",
  "155": "ramramgipako",
  "156": "mijal",
  "157": "seaha",
  "158": "poraiaha",
  "159": "mijalo",
  "160": "kal.aha",
  "161": "schoolchi",
  "162": "rama",
  "163": "re.angaha",
  "164": "mirongko",
  "165": "nangko",
  "166": "ka.sa",
  "167": "neng.take",
  "168": "ni.enga",
  "169": "nokchi",
  "170": "re.anga",
  "171": "noko",
  "172": "noksa",
  "173": "sal.enga",
  "174": "okrienga",
  "175": "ontisa",
  "176": "somoioni",
  "177": "porai.enga",
  "178": "re.a",
  "179": "re.enga",
  "180": "ring.enga",
  "181": "rongchi",
  "182": "rongtalat.enga",
  "183": "sawa",
  "184": "schoolona",
  "185": "sea.enga",
  "186": "sengso.enga",
  "187": "skie",
  "188": "ra.enga",
  "189": "skigipa",
  "190": "song.enga",
  "191": "ta.rake",
  "192": "ta.raken",
  "193": "re.bapilgen",
  "194": "tale",
  "195": "agangen",
  "196": "tusi.enga",
  "197": "tusigen",
  "198": "tusina",
  "199": "tv",
  "200": "nie",
  "201": "ming",
  "202": "walni",
  "203": "ringaha",
  "204": "angaba",
  "205": "namenga",
  "206": "angade",
  "207": "kramchi",
  "208": "rarajok",
  "209": "angchina",
  "210": "nibo",
  "211": "angko",
  "212": "dak.chakanina",
  "213": "mitela",
  "214": "dakchakbo",
  "215": "kema",
  "216": "ka.bo",
  "217": "ka.pabo",
  "218": "rohit",
  "219": "minga",
  "220": "kabo",
  "221": "re.bajoko",
  "222": "dakchakna",
  "223": "mangenma",
  "224": "namen",
  "225": "khashabo",
  "226": "nangja",
  "227": "onbo",
  "228": "angni",
  "229": "biming",
  "230": "marak",
  "231": "biminga",
  "232": "bokma",
  "233": "mikuengjok",
  "234": "okrieming",
  "235": "botol",
  "236": "angnin",
  "237": "gualani",
  "238": "ango",
  "239": "ka.ani",
  "240": "nengnikani",
  "241": "asong",
  "242": "asong.enga",
  "243": "asongbo",
  "244": "atchiata",
  "245": "atchu",
  "246": "attamnam",
  "247": "awang",
  "248": "baba",
  "249": "bachi",
  "250": "maidake",
  "251": "doarang",
  "252": "bilang.enga",
  "253": "?",
  "254": "bachina",
  "255": "chiringni",
  "256": "joka.enga",
  "257": "badia",
  "258": "bite",
  "259": "chibata",
  "260": "rubata",
  "261": "poraienga",
  "262": "ki.tapko",
  "263": "nangni",
  "264": "badita",
  "265": "badiya",
  "266": "golpo",
  "267": "baita",
  "268": "cha.ani",
  "269": "dongku.enga",
  "270": "nokrang",
  "271": "songadamo",
  "272": "bajal",
  "273": "bakos",
  "274": "ning.ao",
  "275": "banga",
  "276": "bano",
  "277": "basako",
  "278": "chagen",
  "279": "bisarang",
  "280": "jajong",
  "281": "nadogen",
  "282": "kadinga",
  "283": "basakoni",
  "284": "bia",
  "285": "apple",
  "286": "cha.aha",
  "287": "bus",
  "288": "o",
  "289": "reba.a",
  "290": "chamanjok",
  "291": "walgimik",
  "292": "tua",
  "293": "bigil",
  "294": "bisong",
  "295": "olakiramchi",
  "296": ".",
  "297": "cha.ha",
  "298": "chabi",
  "299": "chabo",
  "300": "chakat",
  "301": "chakatbo",
  "302": "chakatjok",
  "303": "chinga",
  "304": "chingna",
  "305": "chingo",
  "306": "chona",
  "307": "chongipa",
  "308": "dada",
  "309": "daka",
  "310": "dakenga",
  "311": "dal.a",
  "312": "dalgipa",
  "313": "dambe",
  "314": "me.chik",
  "315": "pante",
  "316": "tai",
  "317": "talatbo",
  "318": "daon",
  "319": "dakat",
  "320": "de",
  "321": "bye",
  "322": "dongbo",
  "323": "dingbea",
  "324": "da.asalde",
  "325": "do.bok",
  "326": "gada",
  "327": "gen",
  "328": "gingting",
  "329": "gitok",
  "330": "gondu",
  "331": "gora",
  "332": "hai",
  "333": "apsan",
  "334": "re.na",
  "335": "indide",
  "336": "hey",
  "337": "hi",
  "338": "hoe",
  "339": "busy",
  "340": "cha.jok",
  "341": "mangenba",
  "342": "katta",
  "343": "knae",
  "344": "ihing",
  "345": "masijaha",
  "346": "manjawa",
  "347": "kakuja",
  "348": "namja",
  "349": "indiba",
  "350": "indita",
  "351": "ja.a",
  "352": "ja.ping",
  "353": "ja.sku",
  "354": "dema",
  "355": "jachok",
  "356": "jajrengnabe",
  "357": "jak",
  "358": "jakpa",
  "359": "jakpong",
  "360": "jaksi",
  "361": "jaksirang",
  "362": "jakskil",
  "363": "nangming",
  "364": "janggil",
  "365": "jegita",
  "366": "jisuna",
  "367": "rasong",
  "368": "jojong",
  "369": "jumang",
  "370": "ka.bak",
  "371": "ka.saenga",
  "372": "ka.sapae",
  "373": "ianona",
  "374": "re.babo",
  "375": "kang.kare",
  "376": "kasapae",
  "377": "kasine",
  "378": "khuliaha",
  "379": "khulibo",
  "380": "khuligen",
  "381": "ki.sangchi",
  "382": "ki.singkop",
  "383": "nigen",
  "384": "re.angen",
  "385": "kni",
  "386": "ku.chil",
  "387": "ku.dipe",
  "388": "ku.sik",
  "389": "ku.simang",
  "390": "ma.a",
  "391": "paa",
  "392": "rang",
  "393": "neng.nikani",
  "394": "ong.enga",
  "395": "classroomo",
  "396": "somoi",
  "397": "ongenga",
  "398": "doa",
  "399": "somoio",
  "400": "sal",
  "401": "napgen",
  "402": "maia",
  "403": "maina",
  "404": "cha.na",
  "405": "man.a",
  "406": "uamang",
  "407": "lekao",
  "408": "chokga",
  "409": "chanchi.enga",
  "410": "miksonga",
  "411": "askirang",
  "412": "ching.enga",
  "413": "mango",
  "414": "tusienga",
  "415": "mama",
  "416": "man.gen",
  "417": "mani",
  "418": "marong",
  "419": "masia",
  "420": "masu",
  "421": "matcha",
  "422": "matchapeng",
  "423": "matchok",
  "424": "matchu",
  "425": "dobok",
  "426": "matma",
  "427": "menggo",
  "428": "mengotchi",
  "429": "mes",
  "430": "kataha",
  "431": "mikkang",
  "432": "mikron",
  "433": "miksram",
  "434": "mongma",
  "435": "n.a",
  "436": "a",
  "437": "batchi",
  "438": "re",
  "439": "amenga",
  "440": "dakgen",
  "441": "man",
  "442": "genma",
  "443": "masiama",
  "444": "senggen",
  "445": "ma",
  "446": "bisarangming",
  "447": "ka.la",
  "448": "angana",
  "449": "man.ama",
  "450": "iachi",
  "451": "rebabo",
  "452": "sal.a",
  "453": "miksonge",
  "454": "aganenga",
  "455": "masiaha",
  "456": "chajokma",
  "457": "pen",
  "458": "on.a",
  "459": "rake",
  "460": "re.baengama",
  "461": "rebagen",
  "462": "rebana",
  "463": "mangen",
  "464": "sigen",
  "465": "uachi",
  "466": "na.aba",
  "467": "ang",
  "468": "baksa",
  "469": "repagenma",
  "470": "na.ara",
  "471": "janggi",
  "472": "tang.ao",
  "473": "kamko",
  "474": "ka.na",
  "475": "namengama",
  "476": "nachil",
  "477": "dake",
  "478": "poraibo",
  "479": "poariabo",
  "480": "namengaba",
  "481": ",",
  "482": "nang",
  "483": "babani",
  "484": "bimingko",
  "485": "namnikgipa",
  "486": "rong.ara",
  "487": "mai.a",
  "488": "gronge",
  "489": "namnik.aha",
  "490": "mitelbejok",
  "491": "namgipa",
  "492": "ong.china",
  "493": "nangnin",
  "494": "nok",
  "495": "nono",
  "496": "oh",
  "497": "olakiram",
  "498": "free",
  "499": "pringnam",
  "500": "ra",
  "501": "rabo",
  "502": "raka",
  "503": "rea",
  "504": "re.ang",
  "505": "reba.aha",
  "506": "rebo",
  "507": "ringbo",
  "508": "rimchaksoa",
  "509": "ripeng",
  "510": "ripengrang",
  "511": "ro.ong",
  "512": "ru.enga",
  "513": "rua",
  "514": "saljatchi",
  "515": "nam",
  "516": "salnam",
  "517": "sani",
  "518": "juttarang",
  "519": "angara",
  "520": "reba.enga",
  "521": "chairo",
  "522": "asongenga",
  "523": "sengbo",
  "524": "silchidare",
  "525": "ska",
  "526": "so.oma",
  "527": "song.a",
  "528": "sre",
  "529": "talat",
  "530": "teka",
  "531": "tusibo",
  "532": "re.angbo",
  "533": "ua",
  "534": "uko",
  "535": "rae",
  "536": "iyangbo",
  "537": "wagam",
  "538": "wak",
  "539": "walnam",
  "540": "songbad",
  "541": "gitrang",
  "542": "mipring",
  "543": "office",
  "544": "songa",
  "545": "english",
  "546": "ra.a",
  "547": "hindi",
  "548": "te.gatchu",
  "549": "namnika",
  "550": "ugitan",
  "551": "namenika",
  "552": "epil",
  "553": "terik",
  "554": "draka",
  "555": "narang",
  "556": "kompiram",
  "557": "robol",
  "558": "hockey",
  "559": "badminton",
  "560": "kal.inga",
  "561": "volleyball",
  "562": "kabaddi",
  "563": "basketball",
  "564": "ki.taprang",
  "565": "poedo",
  "566": "segipa",
  "567": "porai.ga",
  "568": "poraia.ga",
  "569": "novels",
  "570": "megazines",
  "571": "articles",
  "572": "homework",
  "573": "sea.ga",
  "574": "notes",
  "575": "essay",
  "576": "reports",
  "577": "assignments",
  "578": "project",
  "579": "ku.agana",
  "580": "gam.bea",
  "581": "gam.bee",
  "582": "aganinga",
  "583": "rinoke",
  "584": "ku.aganinga",
  "585": "rongtala",
  "586": "rongtale",
  "587": "ka.sae",
  "588": "bike",
  "589": "gari",
  "590": "kolom",
  "591": "hajok",
  "592": "ianon",
  "593": "seng.enga",
  "594": "okam",
  "595": "okamatjok",
  "596": "okam.enga",
  "597": "biko",
  "598": "matchota",
  "599": "matchotatjok",
  "600": "bon.ata",
  "601": "bon.atjok",
  "602": "kobor",
  "603": "knaaha",
  "604": "ra.jok",
  "605": "tangka",
  "606": "nikaha",
  "607": "sakgni",
  "608": "delhi",
  "609": "sokba.aha",
  "610": "sokbaa",
  "611": "skanga",
  "612": "grongaha",
  "613": "gronga",
  "614": "matchotataha",
  "615": "ra.aha",
  "616": "sokang.aha",
  "617": "phoneko",
  "618": "charge",
  "619": "ka.aha",
  "620": "homeworkko",
  "621": "bino",
  "622": "uamango",
  "623": "mirong",
  "624": "nokdang",
  "625": "jakra",
  "626": "jakgasi",
  "627": "kosak",
  "628": "kama",
  "629": "mikang",
  "630": "kisang",
  "631": "mitchia",
  "632": "gisik",
  "633": "skang",
  "634": "kae",
  "635": "ha",
  "636": "jaman",
  "637": "re.angno",
  "638": "reba.gen",
  "639": "bini",
  "640": "uamangni",
  "641": "darangoba",
  "642": "kadongja",
  "643": "nitat.enga",
  "644": "nitat.a",
  "645": "saloba",
  "646": "golpojawa",
  "647": "golpowa",
  "648": "jamani",
  "649": "sikkimgen",
  "650": "uchi",
  "651": "rena",
  "652": "onggija",
  "653": "chanchienga",
  "654": "grapenga",
  "655": "changsao",
  "656": "budepa",
  "657": "butchuma",
  "658": "measarang",
  "659": "mechiksarang",
  "660": "measa",
  "661": "mechiksa",
  "662": "gital",
  "663": "guiter",
  "664": "bajai.ga",
  "665": "sa",
  "666": "gni",
  "667": "gitam",
  "668": "bri",
  "669": "bonga",
  "670": "dok",
  "671": "sni",
  "672": "chet",
  "673": "sku",
  "674": "chisa",
  "675": "chigni",
  "676": "chigitam",
  "677": "chibri",
  "678": "chibonga",
  "679": "chidok",
  "680": "chisni",
  "681": "chichet",
  "682": "chisku",
  "683": "kolgrik",
  "684": "kolachi",
  "685": "sotbri",
  "686": "sotbonga",
  "687": "sotdok",
  "688": "sotsni",
  "689": "sotchet",
  "690": "sotsku",
  "691": "richasa",
  "692": "richagni",
  "693": "richagitam",
  "694": "richabri",
  "695": "richabonga",
  "696": "richadok",
  "697": "richasni",
  "698": "richachet",
  "699": "richasku",
  "700": "hajalsa",
  "701": "hajal",
  "702": "hajalgni",
  "703": "hajalgitam",
  "704": "hajalbri",
  "705": "hajalbonga",
  "706": "hajaldok",
  "707": "hajalsni",
  "708": "hajalchet",
  "709": "hajalsku",
  "710": "lakhsa",
  "711": "saenga",
  "712": "tekjok",
  "713": "duk",
  "714": "onga",
  "715": "kadingenga",
  "716": "katchae",
  "717": "roa",
  "718": "katcha",
  "719": "katchaenga",
  "720": "silbea",
  "721": "nitoa",
  "722": "nitobea",
  "723": "sila",
  "724": "bilaka",
  "725": "mea.sa",
  "726": "nokona",
  "727": "bi.sarangde",
  "728": "simbraengjokna",
  "729": "nang.na",
  "730": "roramenga",
  "731": "rorama",
  "732": "ma.sia",
  "733": "mamingko",
  "734": "ba",
  "735": "ma.sija",
  "736": "ong.ja",
  "737": "maiba"
}