{
  "<pad>": 0,
  "<bos>": 1,
  "<eos>": 2,
  "<unk>": 3,
  "sister": 4,
  "done": 5,
  "answer": 6,
  "i": 7,
  "have": 8,
  "dog": 9,
  "will": 10,
  "eat": 11,
  "tell": 12,
  "me": 13,
  "what": 14,
  "happened": 15,
  "are": 16,
  "you": 17,
  "doing": 18,
  "playing": 19,
  "talk": 20,
  "be": 21,
  "the": 22,
  "told": 23,
  "a": 24,
  "beautiful": 25,
  "flower": 26,
  "okay": 27,
  "listen": 28,
  "carefully": 29,
  "mother": 30,
  "monkey": 31,
  "grandmother": 32,
  "yes": 33,
  "careful": 34,
  "later": 35,
  "call": 36,
  "no": 37,
  "problem": 38,
  "got": 39,
  "it": 40,
  "was": 41,
  "explain": 42,
  "again": 43,
  "look": 44,
  "at": 45,
  "us": 46,
  "we": 47,
  "food": 48,
  "for": 49,
  "saw": 50,
  "film": 51,
  "last": 52,
  "week": 53,
  "crab": 54,
  "am": 55,
  "outside": 56,
  "see": 57,
  "talking": 58,
  "and": 59,
  "going": 60,
  "to": 61,
  "market": 62,
  "bored": 63,
  "in": 64,
  "come": 65,
  "after": 66,
  "some": 67,
  "time": 68,
  "play": 69,
  "with": 70,
  "children": 71,
  "10": 72,
  "years": 73,
  "old": 74,
  "free": 75,
  "now": 76,
  "sleep": 77,
  "student": 78,
  "drink": 79,
  "water": 80,
  "write": 81,
  "letter": 82,
  "dancing": 83,
  "read": 84,
  "book": 85,
  "tonight": 86,
  "eating": 87,
  "working": 88,
  "craving": 89,
  "chicken": 90,
  "bird": 91,
  "dance": 92,
  "festival": 93,
  "live": 94,
  "garo": 95,
  "hill": 96,
  "sing": 97,
  "song": 98,
  "tomorrow": 99,
  "this": 100,
  "area": 101,
  "here": 102,
  "came": 103,
  "work": 104,
  "buy": 105,
  "something": 106,
  "been": 107,
  "long": 108,
  "meet": 109,
  "someone": 110,
  "swimming": 111,
  "laugh": 112,
  "cry": 113,
  "rest": 114,
  "running": 115,
  "run": 116,
  "happy": 117,
  "heard": 118,
  "listening": 119,
  "need": 120,
  "nothing": 121,
  "person": 122,
  "don't": 123,
  "know": 124,
  "cannot": 125,
  "understand": 126,
  "vegetables": 127,
  "meghalaya": 128,
  "ate": 129,
  "rice": 130,
  "simple": 131,
  "wrote": 132,
  "night": 133,
  "danced": 134,
  "yesterday": 135,
  "sang": 136,
  "played": 137,
  "walked": 138,
  "school": 139,
  "love": 140,
  "just": 141,
  "resting": 142,
  "watching": 143,
  "go": 144,
  "home": 145,
  "drawing": 146,
  "hungry": 147,
  "recently": 148,
  "reading": 149,
  "studying": 150,
  "walking": 151,
  "singing": 152,
  "painting": 153,
  "cleaning": 154,
  "who": 155,
  "walk": 156,
  "writing": 157,
  "waiting": 158,
  "learning": 159,
  "teacher": 160,
  "cooking": 161,
  "fast": 162,
  "soon": 163,
  "sleeping": 164,
  "while": 165,
  "television": 166,
  "drank": 167,
  "morning": 168,
  "also": 169,
  "fine": 170,
  "i'm": 171,
  "all": 172,
  "sweaty": 173,
  "towards": 174,
  "thanks": 175,
  "helping": 176,
  "help": 177,
  "forgive": 178,
  "sorry": 179,
  "my": 180,
  "name": 181,
  "is": 182,
  "rohit": 183,
  "when": 184,
  "can": 185,
  "very": 186,
  "much": 187,
  "give": 188,
  "marak": 189,
  "stomach": 190,
  "growling": 191,
  "so": 192,
  "bottle": 193,
  "it's": 194,
  "mistake": 195,
  "sit": 196,
  "siting": 197,
  "down": 198,
  "bear": 199,
  "grandfather": 200,
  "good": 201,
  "evening": 202,
  "paternal": 203,
  "uncle": 204,
  "father": 205,
  "where": 206,
  "how": 207,
  "birds": 208,
  "flying": 209,
  "did": 210,
  "river": 211,
  "flowing": 212,
  "which": 213,
  "sweetest": 214,
  "fruit": 215,
  "tree": 216,
  "tall": 217,
  "yours": 218,
  "many": 219,
  "story": 220,
  "left": 221,
  "houses": 222,
  "village": 223,
  "inside": 224,
  "box": 225,
  "moon": 226,
  "rise": 227,
  "back": 228,
  "he": 229,
  "she": 230,
  "an": 231,
  "apple": 232,
  "by": 233,
  "bus": 234,
  "has": 235,
  "eaten": 236,
  "eats": 237,
  "slept": 238,
  "whole": 239,
  "skin": 240,
  "they": 241,
  "went": 242,
  "mosque": 243,
  "tea": 244,
  "key": 245,
  "up": 246,
  "wake": 247,
  "woke": 248,
  "small": 249,
  "younger": 250,
  "brother": 251,
  "do": 252,
  "big": 253,
  "elder": 254,
  "girl": 255,
  "boy": 256,
  "bye": 257,
  "hot": 258,
  "day": 259,
  "goat": 260,
  "donkey": 261,
  "nose": 262,
  "neck": 263,
  "rhino": 264,
  "horse": 265,
  "let's": 266,
  "together": 267,
  "hey": 268,
  "hi": 269,
  "busy": 270,
  "understood": 271,
  ",": 272,
  "mice": 273,
  "hear": 274,
  "that": 275,
  "not": 276,
  "yet": 277,
  "but": 278,
  "foot": 279,
  "thigh": 280,
  "knee": 281,
  "kneel": 282,
  "leg": 283,
  "worry": 284,
  "hand": 285,
  "palm": 286,
  "arm": 287,
  "finger": 288,
  "fingers": 289,
  "nail": 290,
  "as": 291,
  "hello": 292,
  "dream": 293,
  "chest": 294,
  "loving": 295,
  "please": 296,
  "waist": 297,
  "slowly": 298,
  "opened": 299,
  "open": 300,
  "hip": 301,
  "hair": 302,
  "lip": 303,
  "chin": 304,
  "mouth": 305,
  "mustache": 306,
  "parents": 307,
  "happening": 308,
  "classroom": 309,
  "sun": 310,
  "set": 311,
  "why": 312,
  "written": 313,
  "on": 314,
  "paper": 315,
  "saying": 316,
  "thinking": 317,
  "mean": 318,
  "want": 319,
  "stars": 320,
  "shining": 321,
  "cat": 322,
  "law": 323,
  "maternal": 324,
  "get": 325,
  "bison": 326,
  "cow": 327,
  "tiger": 328,
  "leopard": 329,
  "deer": 330,
  "buffalo": 331,
  "mouse": 332,
  "sheep": 333,
  "ran": 334,
  "face": 335,
  "eye": 336,
  "eyes": 337,
  "eyebrow": 338,
  "thank": 339,
  "elephant": 340,
  "wait": 341,
  "speak": 342,
  "language": 343,
  "drive": 344,
  "about": 345,
  "lunch": 346,
  "your": 347,
  "pen": 348,
  "coming": 349,
  "die": 350,
  "there": 351,
  "would": 352,
  "like": 353,
  "what's": 354,
  "aim": 355,
  "life": 356,
  "ear": 357,
  "ears": 358,
  "study": 359,
  "well": 360,
  "take": 361,
  "care": 362,
  "hard": 363,
  "?": 364,
  "favourite": 365,
  "color": 366,
  "nice": 367,
  "too": 368,
  "watch": 369,
  "house": 370,
  "oh": 371,
  "little": 372,
  "welcome": 373,
  "friend": 374,
  "friends": 375,
  "stone": 376,
  "pouring": 377,
  "pour": 378,
  "afternoon": 379,
  "whose": 380,
  "shoes": 381,
  "these": 382,
  "else": 383,
  "sitting": 384,
  "chair": 385,
  "dances": 386,
  "soft": 387,
  "cook": 388,
  "tongue": 389,
  "lock": 390,
  "one": 391,
  "him": 392,
  "away": 393,
  "teeth": 394,
  "pig": 395,
  "newspaper": 396,
  "reads": 397,
  "writes": 398,
  "songs": 399,
  "breakfast": 400,
  "walks": 401,
  "office": 402,
  "cooks": 403,
  "english": 404,
  "learn": 405,
  "hindi": 406,
  "mango": 407,
  "mangoes": 408,
  "apples": 409,
  "banana": 410,
  "likes": 411,
  "bananas": 412,
  "grape": 413,
  "grapes": 414,
  "orange": 415,
  "oranges": 416,
  "guava": 417,
  "guavas": 418,
  "football": 419,
  "hockey": 420,
  "badminton": 421,
  "plays": 422,
  "volleyball": 423,
  "kabaddi": 424,
  "basketball": 425,
  "books": 426,
  "stories": 427,
  "poem": 428,
  "poet": 429,
  "poems": 430,
  "novels": 431,
  "magazines": 432,
  "articles": 433,
  "homework": 434,
  "notes": 435,
  "essays": 436,
  "reports": 437,
  "assignments": 438,
  "projects": 439,
  "loud": 440,
  "loudly": 441,
  "speaks": 442,
  "sofly": 443,
  "softly": 444,
  "clear": 445,
  "clearly": 446,
  "politely": 447,
  "bike": 448,
  "car": 449,
  "living": 450,
  "called": 451,
  "calling": 452,
  "her": 453,
  "complete": 454,
  "completed": 455,
  "finish": 456,
  "finished": 457,
  "news": 458,
  "learned": 459,
  "money": 460,
  "seen": 461,
  "two": 462,
  "brothers": 463,
  "visited": 464,
  "delhi": 465,
  "arrived": 466,
  "arrive": 467,
  "met": 468,
  "before": 469,
  "project": 470,
  "reached": 471,
  "charged": 472,
  "phone": 473,
  "family": 474,
  "right": 475,
  "front": 476,
  "dirty": 477,
  "mind": 478,
  "tried": 479
}