{
  "<pad>": 0,
  "<bos>": 1,
  "<eos>": 2,
  "<unk>": 3,
  "abi": 4,
  "ongjok": 5,
  "aganchakani": 6,
  "anga": 7,
  "achak": 8,
  "cha.gen": 9,
  "agan": 10,
  "angna": 11,
  "mai": 12,
  "ong.achim": 13,
  "na.a": 14,
  "dak.enga": 15,
  "maiko": 16,
  "kal.enga": 17,
  "agana": 18,
  "aganchakani.ara": 19,
  "ong.en": 20,
  "aganjok": 21,
  "aiao": 22,
  "bibal": 23,
  "silade": 24,
  "!": 25,
  "am": 26,
  "name": 27,
  "knatimbo": 28,
  "ama": 29,
  "amak": 30,
  "ambi": 31,
  "amde": 32,
  "dongen": 33,
  "amm": 34,
  "jamano": 35,
  "golpogen": 36,
  "nangna": 37,
  "call": 38,
  "kagen": 39,
  "maming": 40,
  "ongja": 41,
  "masijok": 42,
  "nama": 43,
  "ammde": 44,
  "daoba": 45,
  "talatenga": 46,
  "anchiko": 47,
  "ni.atbo": 48,
  "anching": 49,
  "mi": 50,
  "cha.a": 51,
  "anchingna": 52,
  "ang.a": 53,
  "ia": 54,
  "film": 55,
  "ko": 56,
  "nia": 57,
  "mija": 58,
  "antio": 59,
  "ang.ke": 60,
  "a.palo": 61,
  "achako": 62,
  "agan.enga": 63,
  "aro": 64,
  "knatima": 65,
  "antichi": 66,
  "re.angenga": 67,
  "apalchi": 68,
  "arataha": 69,
  "bajalo": 70,
  "bajalona": 71,
  "basakoba": 72,
  "re.bagen": 73,
  "bi.sarangming": 74,
  "kal.a": 75,
  "bilsi": 76,
  "chiking": 77,
  "bol": 78,
  "pang": 79,
  "dao": 80,
  "tusia": 81,
  "chatro": 82,
  "chi": 83,
  "ringa": 84,
  "chitti": 85,
  "sea": 86,
  "chrok.enga": 87,
  "da.al": 88,
  "walo": 89,
  "ki.tap": 90,
  "poraigen": 91,
  "cha.enga": 92,
  "kam": 93,
  "ka.enga": 94,
  "do.o": 95,
  "cha.ana": 96,
  "sikbe.engjok": 97,
  "do.oko": 98,
  "nika": 99,
  "festivalo": 100,
  "chroka": 101,
  "garo": 102,
  "hillo": 103,
  "donga": 104,
  "git": 105,
  "ringen": 106,
  "kinalo": 107,
  "biapo": 108,
  "dong.a": 109,
  "iano": 110,
  "na": 111,
  "re.baa": 112,
  "maikoba": 113,
  "brena": 114,
  "ru.ta": 115,
  "somoionin": 116,
  "dong.enga": 117,
  "sakoba": 118,
  "grongna": 119,
  "reba": 120,
  "ja.man": 121,
  "no": 122,
  "jro.enga": 123,
  "ka.dinga": 124,
  "grapa": 125,
  "kaam": 126,
  "kalgen": 127,
  "ka.a": 128,
  "neng.taka": 129,
  "kammo": 130,
  "kat.enga": 131,
  "kata": 132,
  "katchaenga": 133,
  "poraia": 134,
  "chiti": 135,
  "chokgen": 136,
  "chrokgen": 137,
  "katgen": 138,
  "kna.a": 139,
  "kna.enga": 140,
  "nanga": 141,
  "mamingba": 142,
  "dakja.enga": 143,
  "mande": 144,
  "masija": 145,
  "iako": 146,
  "me.su": 147,
  "samjakrangko": 148,
  "meghalayao": 149,
  "songdonga": 150,
  "cha": 151,
  "enga": 152,
  "miakoba": 153,
  "ramramgipako": 154,
  "mijal": 155,
  "seaha": 156,
  "poraiaha": 157,
  "mijalo": 158,
  "kal.aha": 159,
  "schoolchi": 160,
  "rama": 161,
  "re.angaha": 162,
  "mirongko": 163,
  "nangko": 164,
  "kasa": 165,
  "neng.take": 166,
  "ni.enga": 167,
  "nokchi": 168,
  "re.anga": 169,
  "noko": 170,
  "noksa": 171,
  "sal.enga": 172,
  "okkrienga": 173,
  "ontisa": 174,
  "somoioni": 175,
  "porai.enga": 176,
  "re.a": 177,
  "re.enga": 178,
  "ring.enga": 179,
  "rongchi": 180,
  "rongtalat.enga": 181,
  "sawa": 182,
  "schoolona": 183,
  "sea.enga": 184,
  "sengso.enga": 185,
  "skie": 186,
  "ra.enga": 187,
  "skigipa": 188,
  "song.enga": 189,
  "ta.rake": 190,
  "ta.raken": 191,
  "re.bapilgen": 192,
  "tale": 193,
  "agangen": 194,
  "tusi.enga": 195,
  "tusigen": 196,
  "tusina": 197,
  "tv": 198,
  "nie": 199,
  "ming": 200,
  "walni": 201,
  "ringaha": 202,
  "angaba": 203,
  "namenga": 204,
  "angade": 205,
  "kramchi": 206,
  "rarajok": 207,
  "okrienga": 208,
  "angchina": 209,
  "nibo": 210,
  "angko": 211,
  "dak.chakanina": 212,
  "mitela": 213,
  "dakchakbo": 214,
  "kema": 215,
  "ka.bo": 216,
  "ka.pabo": 217,
  "rohit": 218,
  "minga": 219,
  "kabo": 220,
  "re.bajoko": 221,
  "dakchakna": 222,
  "mangenma": 223,
  "namen": 224,
  "khashabo": 225,
  "nangja": 226,
  "onbo": 227,
  "angni": 228,
  "biming": 229,
  "marak": 230,
  "biminga": 231,
  "bokma": 232,
  "mikuengjok": 233,
  "okrieming": 234,
  "botol": 235,
  "angnin": 236,
  "gualani": 237,
  "ong.a": 238,
  "ango": 239,
  "ka.ani": 240,
  "nengnikani": 241,
  "asong": 242,
  "asong.enga": 243,
  "asongbo": 244,
  "atchiata": 245,
  "atchu": 246,
  "attamnam": 247,
  "awang": 248,
  "baba": 249,
  "bachi": 250,
  "maidake": 251,
  "doarang": 252,
  "bilang.enga": 253,
  "?": 254,
  "bachina": 255,
  "chiringni": 256,
  "joka.enga": 257,
  "badia": 258,
  "bite": 259,
  "chibata": 260,
  "rubata": 261,
  "poraienga": 262,
  "ki.tapko": 263,
  "nangni": 264,
  "badita": 265,
  "badiya": 266,
  "golpo": 267,
  "baita": 268,
  "cha.ani": 269,
  "dongku.enga": 270,
  "nokrang": 271,
  "songadamo": 272,
  "bajal": 273,
  "bakos": 274,
  "ning.ao": 275,
  "banga": 276,
  "bano": 277,
  "basako": 278,
  "chagen": 279,
  "bisarang": 280,
  "jajong": 281,
  "nadogen": 282,
  "kadinga": 283,
  "basakoni": 284,
  "bia": 285,
  "apple": 286,
  "cha.aha": 287,
  "bus": 288,
  "o": 289,
  "reba.a": 290,
  "chamanjok": 291,
  "walgimik": 292,
  "tua": 293,
  "bigil": 294,
  "bisong": 295,
  "olakiramchi": 296,
  ".": 297,
  "cha.ha": 298,
  "chabi": 299,
  "chabo": 300,
  "chakat": 301,
  "chakatbo": 302,
  "chakatjok": 303,
  "chinga": 304,
  "chingna": 305,
  "chingo": 306,
  "chona": 307,
  "chongipa": 308,
  "dada": 309,
  "daka": 310,
  "dakenga": 311,
  "dal.a": 312,
  "dalgipa": 313,
  "dambe": 314,
  "me.chik": 315,
  "pante": 316,
  "tai": 317,
  "talatbo": 318,
  "daon": 319,
  "dakat": 320,
  "de": 321,
  "bye": 322,
  "dongbo": 323,
  "dingbea": 324,
  "da.asalde": 325,
  "do.bok": 326,
  "gada": 327,
  "gen": 328,
  "gingting": 329,
  "gitok": 330,
  "gondu": 331,
  "gora": 332,
  "hai": 333,
  "apsan": 334,
  "re.na": 335,
  "indide": 336,
  "hey": 337,
  "hi": 338,
  "hoe": 339,
  "busy": 340,
  "cha.jok": 341,
  "mangenba": 342,
  "katta": 343,
  "knae": 344,
  "kusi": 345,
  "ihing": 346,
  "masijaha": 347,
  "manjawa": 348,
  "kakuja": 349,
  "namja": 350,
  "indiba": 351,
  "indita": 352,
  "ja.a": 353,
  "ja.ping": 354,
  "ja.sku": 355,
  "dema": 356,
  "jachok": 357,
  "jajrengnabe": 358,
  "jak": 359,
  "jakpa": 360,
  "jakpong": 361,
  "jaksi": 362,
  "jaksirang": 363,
  "jakskil": 364,
  "nangming": 365,
  "janggil": 366,
  "jegita": 367,
  "jisuna": 368,
  "rasong": 369,
  "jojong": 370,
  "jumang": 371,
  "ka.bak": 372,
  "ka.sa": 373,
  "ka.saenga": 374,
  "ka.sapae": 375,
  "ianona": 376,
  "re.babo": 377,
  "kang.kare": 378,
  "kasapae": 379,
  "kasine": 380,
  "khuliaha": 381,
  "khulibo": 382,
  "khuligen": 383,
  "ki.sangchi": 384,
  "ki.singkop": 385,
  "nigen": 386,
  "re.angen": 387,
  "kni": 388,
  "ku.chil": 389,
  "ku.dipe": 390,
  "ku.sik": 391,
  "ku.simang": 392,
  "ma.a": 393,
  "paa": 394,
  "rang": 395,
  "neng.nikani": 396,
  "ong.enga": 397,
  "classroomo": 398,
  "somoi": 399,
  "ongenga": 400,
  "doa": 401,
  "somoio": 402,
  "sal": 403,
  "napgen": 404,
  "maia": 405,
  "maina": 406,
  "cha.na": 407,
  "man.a": 408,
  "uamang": 409,
  "lekao": 410,
  "chokga": 411,
  "chanchi.enga": 412,
  "miksonga": 413,
  "askirang": 414,
  "ching.enga": 415,
  "mango": 416,
  "tusienga": 417,
  "mama": 418,
  "man.gen": 419,
  "mani": 420,
  "marong": 421,
  "masia": 422,
  "masu": 423,
  "matcha": 424,
  "matchapeng": 425,
  "matchok": 426,
  "matchu": 427,
  "dobok": 428,
  "matma": 429,
  "menggo": 430,
  "mengotchi": 431,
  "mes": 432,
  "kataha": 433,
  "mikkang": 434,
  "mikron": 435,
  "miksram": 436,
  "mongma": 437,
  "n.a": 438,
  "a": 439,
  "batchi": 440,
  "re": 441,
  "amenga": 442,
  "dakgen": 443,
  "man": 444,
  "genma": 445,
  "masiama": 446,
  "senggen": 447,
  "ma": 448,
  "bisarangming": 449,
  "ka.la": 450,
  "angana": 451,
  "man.ama": 452,
  "iachi": 453,
  "rebabo": 454,
  "sal.a": 455,
  "miksonge": 456,
  "aganenga": 457,
  "masiaha": 458,
  "chajokma": 459,
  "pen": 460,
  "on.a": 461,
  "rake": 462,
  "re.baengama": 463,
  "rebagen": 464,
  "rebana": 465,
  "mangen": 466,
  "sigen": 467,
  "uachi": 468,
  "na.aba": 469,
  "ang": 470,
  "baksa": 471,
  "repagenma": 472,
  "na.ara": 473,
  "janggi": 474,
  "tang.ao": 475,
  "kamko": 476,
  "ka.na": 477,
  "namengama": 478,
  "nachil": 479,
  "dake": 480,
  "poraibo": 481,
  "poariabo": 482,
  "namengaba": 483,
  ",": 484,
  "nang": 485,
  "babani": 486,
  "bimingko": 487,
  "namnikgipa": 488,
  "rong.ara": 489,
  "mai.a": 490,
  "gronge": 491,
  "namnik.aha": 492,
  "mitelbejok": 493,
  "namgipa": 494,
  "ong.china": 495,
  "nangnin": 496,
  "nok": 497,
  "nono": 498,
  "oh": 499,
  "olakiram": 500,
  "free": 501,
  "pringnam": 502,
  "ra": 503,
  "rabo": 504,
  "raka": 505,
  "rea": 506,
  "re.ang": 507,
  "reba.aha": 508,
  "rebo": 509,
  "ringbo": 510,
  "rimchaksoa": 511,
  "ripeng": 512,
  "ripengrang": 513,
  "ro.ong": 514,
  "ru.enga": 515,
  "rua": 516,
  "saljatchi": 517,
  "nam": 518,
  "salnam": 519,
  "sani": 520,
  "juttarang": 521,
  "angara": 522,
  "reba.enga": 523,
  "chairo": 524,
  "asongenga": 525,
  "sengbo": 526,
  "silchidare": 527,
  "ska": 528,
  "so.oma": 529,
  "song.a": 530,
  "sre": 531,
  "talat": 532,
  "teka": 533,
  "tusibo": 534,
  "re.angbo": 535,
  "ua": 536,
  "uko": 537,
  "rae": 538,
  "iyangbo": 539,
  "wagam": 540,
  "wak": 541,
  "walnam": 542,
  "songbad": 543,
  "gitrang": 544,
  "mipring": 545,
  "office": 546,
  "songa": 547,
  "english": 548,
  "ra.a": 549,
  "hindi": 550,
  "te.gatchu": 551,
  "namnika": 552,
  "ugitan": 553,
  "namenika": 554,
  "epil": 555,
  "terik": 556,
  "draka": 557,
  "narang": 558,
  "kompiram": 559,
  "robol": 560,
  "hockey": 561,
  "badminton": 562,
  "kal.inga": 563,
  "volleyball": 564,
  "kabaddi": 565,
  "basketball": 566,
  "ki.taprang": 567,
  "poedo": 568,
  "segipa": 569,
  "porai.ga": 570,
  "poraia.ga": 571,
  "novels": 572,
  "megazines": 573,
  "articles": 574,
  "homework": 575,
  "sea.ga": 576,
  "notes": 577,
  "essay": 578,
  "reports": 579,
  "assignments": 580,
  "project": 581,
  "ku.agana": 582,
  "gam.bea": 583,
  "gam.bee": 584,
  "aganinga": 585,
  "rinoke": 586,
  "ku.aganinga": 587,
  "rongtala": 588,
  "rongtale": 589,
  "ka.sae": 590,
  "bike": 591,
  "gari": 592,
  "kolom": 593,
  "hajok": 594,
  "ianon": 595,
  "seng.enga": 596,
  "okam": 597,
  "okamatjok": 598,
  "okam.enga": 599,
  "biko": 600,
  "matchota": 601,
  "matchotatjok": 602,
  "bon.ata": 603,
  "bon.atjok": 604,
  "kobor": 605,
  "knaaha": 606,
  "ra.jok": 607,
  "tangka": 608,
  "nikaha": 609,
  "sakgni": 610,
  "delhi": 611,
  "sokba.aha": 612,
  "sokbaa": 613,
  "skanga": 614,
  "grongaha": 615,
  "gronga": 616,
  "matchotataha": 617,
  "ra.aha": 618,
  "sokang.aha": 619,
  "phoneko": 620,
  "charge": 621,
  "ka.aha": 622,
  "homeworkko": 623,
  "bino": 624,
  "uamango": 625,
  "mirong": 626,
  "nokdang": 627,
  "jakra": 628,
  "jakgasi": 629,
  "kosak": 630,
  "kama": 631,
  "mikang": 632,
  "kisang": 633,
  "mitchia": 634,
  "gisik": 635,
  "skang": 636,
  "kae": 637,
  "ha": 638,
  "jaman": 639,
  "re.angno": 640,
  "reba.gen": 641
}