{
  "<pad>": 0,
  "<bos>": 1,
  "<eos>": 2,
  "<unk>": 3,
  "abi": 4,
  "ongjok": 5,
  "aganchakani": 6,
  "anga": 7,
  "achak": 8,
  "cha.gen": 9,
  "agan": 10,
  "angna": 11,
  "mai": 12,
  "ong.achim": 13,
  "na.a": 14,
  "dakenga": 15,
  "maiko": 16,
  "kalenga": 17,
  "aganchakani.ara": 18,
  "ong.en": 19,
  "aganjok": 20,
  "aiao": 21,
  "bibal": 22,
  "silade": 23,
  "!": 24,
  "am": 25,
  "name": 26,
  "knatimbo": 27,
  "ama": 28,
  "amak": 29,
  "ambi": 30,
  "amde": 31,
  "dongen": 32,
  "amm": 33,
  "jamano": 34,
  "golpogen": 35,
  "nangna": 36,
  "call": 37,
  "kagen": 38,
  "maming": 39,
  "ongja": 40,
  "masijok": 41,
  "nama": 42,
  "ammde": 43,
  "daoba": 44,
  "talatenga": 45,
  "anchiko": 46,
  "ni.atbo": 47,
  "anching": 48,
  "mi": 49,
  "cha.a": 50,
  "anchingna": 51,
  "ang.a": 52,
  "ia": 53,
  "film": 54,
  "ko": 55,
  "nia": 56,
  "mija": 57,
  "antio": 58,
  "ang.ke": 59,
  "a.palo": 60,
  "achako": 61,
  "golpoenga": 62,
  "golpoa": 63,
  "aro": 64,
  "knatima": 65,
  "antichi": 66,
  "re.angenga": 67,
  "apalchi": 68,
  "arataha": 69,
  "bajalo": 70,
  "bajalona": 71,
  "basakoba": 72,
  "re.bagen": 73,
  "bi.sarangming": 74,
  "kal.a": 75,
  "bilsi": 76,
  "chiking": 77,
  "bol": 78,
  "pang": 79,
  "dao": 80,
  "tusia": 81,
  "chatro": 82,
  "chi": 83,
  "ringa": 84,
  "chitti": 85,
  "sea": 86,
  "chrokenga": 87,
  "da.al": 88,
  "walo": 89,
  "ki.tap": 90,
  "poraigen": 91,
  "chaenga": 92,
  "kam": 93,
  "kaenga": 94,
  "do.o": 95,
  "cha.ana": 96,
  "sikbe.engjok": 97,
  "do.oko": 98,
  "nika": 99,
  "festivalo": 100,
  "chroka": 101,
  "garo": 102,
  "hillo": 103,
  "donga": 104,
  "git": 105,
  "ringen": 106,
  "kinalo": 107,
  "biapo": 108,
  "dong.a": 109,
  "iano": 110,
  "na": 111,
  "re.baa": 112,
  "maikoba": 113,
  "brena": 114,
  "ru.ta": 115,
  "somoionin": 116,
  "dongenga": 117,
  "sakoba": 118,
  "grongna": 119,
  "reba": 120,
  "ja.man": 121,
  "no": 122,
  "jroenga": 123,
  "ka.dinga": 124,
  "grapa": 125,
  "kaam": 126,
  "kalgen": 127,
  "ka.a": 128,
  "neng.taka": 129,
  "kammo": 130,
  "katenga": 131,
  "kata": 132,
  "katchaenga": 133,
  "poraia": 134,
  "chiti": 135,
  "chokgen": 136,
  "chrokgen": 137,
  "katgen": 138,
  "kna.a": 139,
  "knaenga": 140,
  "nanga": 141,
  "mamingba": 142,
  "dakjaenga": 143,
  "mande": 144,
  "masija": 145,
  "iako": 146,
  "me.su": 147,
  "samjakrangko": 148,
  "meghalayao": 149,
  "songdonga": 150,
  "cha": 151,
  "enga": 152,
  "miakoba": 153,
  "ramramgipako": 154,
  "mijal": 155,
  "seaha": 156,
  "poraiaha": 157,
  "mijalo": 158,
  "kal.aha": 159,
  "schoolchi": 160,
  "rama": 161,
  "re.angaha": 162,
  "mirongko": 163,
  "nangko": 164,
  "aganenga": 165,
  "kasa": 166,
  "neng.take": 167,
  "nienga": 168,
  "nokchi": 169,
  "re.anga": 170,
  "noko": 171,
  "noksa": 172,
  "salenga": 173,
  "ontisa": 174,
  "somoioni": 175,
  "poraienga": 176,
  "re.a": 177,
  "reenga": 178,
  "ringenga": 179,
  "rongchi": 180,
  "rongtalatenga": 181,
  "sawa": 182,
  "schoolona": 183,
  "seaenga": 184,
  "sengsoenga": 185,
  "skie": 186,
  "raenga": 187,
  "skigipa": 188,
  "songenga": 189,
  "ta.rake": 190,
  "ta.raken": 191,
  "re.bapilgen": 192,
  "tale": 193,
  "agangen": 194,
  "tusienga": 195,
  "tusigen": 196,
  "tusina": 197,
  "tv": 198,
  "nie": 199,
  "ming": 200,
  "walni": 201,
  "ringaha": 202,
  "angaba": 203,
  "namenga": 204,
  "angade": 205,
  "kramchi": 206,
  "rarajok": 207,
  "okrienga": 208,
  "angchina": 209,
  "nibo": 210,
  "angko": 211,
  "dak.chakanina": 212,
  "mitela": 213,
  "dakchakbo": 214,
  "kema": 215,
  "ka.bo": 216,
  "ka.pabo": 217,
  "rohit": 218,
  "minga": 219,
  "kabo": 220,
  "re.bajoko": 221,
  "dakchakna": 222,
  "mangenma": 223,
  "namen": 224,
  "khashabo": 225,
  "nangja": 226,
  "onbo": 227,
  "angni": 228,
  "biming": 229,
  "marak": 230,
  "biminga": 231,
  "bokma": 232,
  "mikuengjok": 233,
  "okrieming": 234,
  "botol": 235,
  "angnin": 236,
  "gualani": 237,
  "ong.a": 238,
  "ango": 239,
  "ka.ani": 240,
  "nengnikani": 241,
  "asong": 242,
  "asongenga": 243,
  "asongbo": 244,
  "atchiata": 245,
  "atchu": 246,
  "attamnam": 247,
  "awang": 248,
  "baba": 249,
  "bachi": 250,
  "maidake": 251,
  "doarang": 252,
  "bilangenga": 253,
  "?": 254,
  "bachina": 255,
  "chiringni": 256,
  "jokaenga": 257,
  "badia": 258,
  "bite": 259,
  "chibata": 260,
  "rubata": 261,
  "ki.tapko": 262,
  "nangni": 263,
  "badita": 264,
  "badiya": 265,
  "golpo": 266,
  "agana": 267,
  "baita": 268,
  "cha.ani": 269,
  "dongkuenga": 270,
  "nokrang": 271,
  "songadamo": 272,
  "bajal": 273,
  "bakos": 274,
  "ning.ao": 275,
  "banga": 276,
  "bano": 277,
  "basako": 278,
  "chagen": 279,
  "bisarang": 280,
  "jajong": 281,
  "nadogen": 282,
  "kadinga": 283,
  "basakoni": 284,
  "bia": 285,
  "apple": 286,
  "cha.aha": 287,
  "bus": 288,
  "o": 289,
  "reba.a": 290,
  "chamanjok": 291,
  "walgimik": 292,
  "tua": 293,
  "bigil": 294,
  "bisong": 295,
  "olakiramchi": 296,
  "cha.ha": 297,
  "chabi": 298,
  "chabo": 299,
  "chakat": 300,
  "chakatbo": 301,
  "chakatjok": 302,
  "chinga": 303,
  "chingna": 304,
  "chingo": 305,
  "chona": 306,
  "chongipa": 307,
  "dada": 308,
  "daka": 309,
  "dal.a": 310,
  "dalgipa": 311,
  "dambe": 312,
  "me.chik": 313,
  "pante": 314,
  "tai": 315,
  "talatbo": 316,
  "daon": 317,
  "dakat": 318,
  "de": 319,
  "bye": 320,
  "dongbo": 321,
  "dingbea": 322,
  "da.asalde": 323,
  "do.bok": 324,
  "gada": 325,
  "gen": 326,
  "gingting": 327,
  "gitok": 328,
  "gondu": 329,
  "gora": 330,
  "hai": 331,
  "apsan": 332,
  "re.na": 333,
  "indide": 334,
  "hey": 335,
  "hi": 336,
  "hoe": 337,
  "busy": 338,
  "cha.jok": 339,
  "mangenba": 340,
  "katta": 341,
  "knae": 342,
  "kusi": 343,
  "ihing": 344,
  "masijaha": 345,
  "manjawa": 346,
  "kakuja": 347,
  "namja": 348,
  "indiba": 349,
  "indita": 350,
  "ja.a": 351,
  "ja.ping": 352,
  "ja.sku": 353,
  "dema": 354,
  "jachok": 355,
  "jajrengnabe": 356,
  "jak": 357,
  "jakpa": 358,
  "jakpong": 359,
  "jaksi": 360,
  "jaksirang": 361,
  "jakskil": 362,
  "nangming": 363,
  "janggil": 364,
  "jegita": 365,
  "jisuna": 366,
  "rasong": 367,
  "jojong": 368,
  "jumang": 369,
  "ka.bak": 370,
  "ka.sa": 371,
  "ka.saenga": 372,
  "ka.sapae": 373,
  "ianona": 374,
  "re.babo": 375,
  "kang.kare": 376,
  "kasapae": 377,
  "kasine": 378,
  "khuliaha": 379,
  "khulibo": 380,
  "khuligen": 381,
  "ki.sangchi": 382,
  "ki.singkop": 383,
  "nigen": 384,
  "re.angen": 385,
  "kni": 386,
  "ku.chil": 387,
  "ku.dipe": 388,
  "ku.sik": 389,
  "ku.simang": 390,
  "ma.a": 391,
  "paa": 392,
  "rang": 393,
  "neng.nikani": 394,
  "ongenga": 395,
  "classroomo": 396,
  "somoi": 397,
  "doa": 398,
  "somoio": 399,
  "sal": 400,
  "napgen": 401,
  "maia": 402,
  "maina": 403,
  "cha.na": 404,
  "man.a": 405,
  "uamang": 406,
  "lekao": 407,
  "chokga": 408,
  "chanchienga": 409,
  "miksonga": 410,
  "askirang": 411,
  "chingenga": 412,
  "mango": 413,
  "mama": 414,
  "man.gen": 415,
  "mani": 416,
  "marong": 417,
  "masia": 418,
  "masu": 419,
  "matcha": 420,
  "matchapeng": 421,
  "matchok": 422,
  "matchu": 423,
  "dobok": 424,
  "matma": 425,
  "menggo": 426,
  "mengotchi": 427,
  "mes": 428,
  "kataha": 429,
  "mikkang": 430,
  "mikron": 431,
  "miksram": 432,
  "mongma": 433,
  "n.a": 434,
  "a": 435,
  "batchi": 436,
  "re": 437,
  "amenga": 438,
  ".": 439,
  "dakgen": 440,
  "man": 441,
  "genma": 442,
  "masiama": 443,
  "senggen": 444,
  "ma": 445,
  "bisarangming": 446,
  "ka.la": 447,
  "angana": 448,
  "man.ama": 449,
  "iachi": 450,
  "rebabo": 451,
  "sal.a": 452,
  "miksonge": 453,
  "masiaha": 454,
  "chajokma": 455,
  "pen": 456,
  "on.a": 457,
  "rake": 458,
  "re.baengama": 459,
  "rebagen": 460,
  "rebana": 461,
  "mangen": 462,
  "sigen": 463,
  "uachi": 464,
  "na.aba": 465,
  "ang": 466,
  "baksa": 467,
  "repagenma": 468,
  "na.ara": 469,
  "janggi": 470,
  "tang.ao": 471,
  "kamko": 472,
  "ka.na": 473,
  "namengama": 474,
  "nachil": 475,
  "dake": 476,
  "poraibo": 477,
  "poariabo": 478,
  "namengaba": 479,
  ",": 480,
  "nang": 481,
  "babani": 482,
  "bimingko": 483,
  "namnikgipa": 484,
  "rong.ara": 485,
  "mai.a": 486,
  "gronge": 487,
  "namnik.aha": 488,
  "mitelbejok": 489,
  "namgipa": 490,
  "ong.china": 491,
  "nangnin": 492,
  "nok": 493,
  "nono": 494,
  "oh": 495,
  "olakiram": 496,
  "free": 497,
  "pringnam": 498,
  "ra": 499,
  "rabo": 500,
  "raka": 501,
  "rea": 502,
  "re.ang": 503,
  "reangen": 504,
  "reba.aha": 505,
  "rebo": 506,
  "ringbo": 507,
  "rimchaksoa": 508,
  "ripeng": 509,
  "ripengrang": 510,
  "ro.ong": 511,
  "ruenga": 512,
  "rua": 513,
  "saljatchi": 514,
  "nam": 515,
  "salnam": 516,
  "sani": 517,
  "juttarang": 518,
  "angara": 519,
  "rebaenga": 520,
  "chairo": 521,
  "sengbo": 522,
  "silchidare": 523,
  "ska": 524,
  "so.oma": 525,
  "song.a": 526,
  "sre": 527,
  "talat": 528,
  "teka": 529,
  "tusibo": 530,
  "re.angbo": 531,
  "ua": 532,
  "uko": 533,
  "chaa": 534,
  "rae": 535,
  "iyangbo": 536,
  "wagam": 537,
  "wak": 538,
  "walnam": 539,
  "songbad": 540,
  "gitrang": 541,
  "mipring": 542,
  "office": 543,
  "songa": 544,
  "english": 545,
  "ra.a": 546,
  "hindi": 547,
  "te.gatchu": 548,
  "namnika": 549,
  "ugitan": 550,
  "namenika": 551,
  "epil": 552,
  "terik": 553,
  "draka": 554,
  "narang": 555,
  "kompiram": 556,
  "robol": 557,
  "hockey": 558,
  "badminton": 559,
  "kal.inga": 560,
  "volleyball": 561,
  "kabaddi": 562,
  "basketball": 563,
  "ki.taprang": 564,
  "poedo": 565,
  "segipa": 566,
  "porai.ga": 567,
  "poraia.ga": 568,
  "novels": 569,
  "megazines": 570,
  "articles": 571,
  "homework": 572,
  "sea.ga": 573,
  "notes": 574,
  "essay": 575,
  "reports": 576,
  "assignments": 577,
  "project": 578,
  "ku.agana": 579,
  "gam.bea": 580,
  "gam.bee": 581,
  "aganinga": 582,
  "rinoke": 583,
  "ku.aganinga": 584,
  "rongtala": 585,
  "rongtale": 586,
  "ka.sae": 587,
  "bike": 588,
  "gari": 589,
  "kolom": 590,
  "ra.enga": 591,
  "hajok": 592,
  "ianon": 593,
  "dong.enga": 594,
  "porai.enga": 595,
  "seng.enga": 596,
  "ka.enga": 597,
  "okam": 598,
  "okamatjok": 599,
  "okam.enga": 600,
  "biko": 601,
  "matchota": 602,
  "matchotatjok": 603,
  "bon.ata": 604,
  "bon.atjok": 605,
  "kobor": 606,
  "knaaha": 607,
  "ra.jok": 608,
  "tangka": 609,
  "nikaha": 610,
  "sakgni": 611,
  "delhi": 612,
  "sokba.aha": 613,
  "sokbaa": 614,
  "skanga": 615,
  "grongaha": 616,
  "gronga": 617,
  "matchotataha": 618,
  "ra.aha": 619,
  "sokang.aha": 620,
  "phoneko": 621,
  "charge": 622,
  "ka.aha": 623,
  "homeworkko": 624,
  "bino": 625,
  "uamango": 626,
  "mirong": 627,
  "nokdang": 628,
  "jakra": 629,
  "jakgasi": 630,
  "kosak": 631,
  "kama": 632,
  "mikang": 633,
  "kisang": 634,
  "mitchia": 635,
  "gisik": 636,
  "skang": 637,
  "kae": 638,
  "ha": 639,
  "jaman": 640,
  "re.angno": 641,
  "reba.gen": 642,
  "bini": 643,
  "uamangni": 644,
  "darangoba": 645,
  "kadongja": 646,
  "nitat.enga": 647,
  "nitat.a": 648,
  "saloba": 649,
  "golpojawa": 650,
  "golpowa": 651,
  "jamani": 652,
  "sikkimgen": 653,
  "uchi": 654,
  "rena": 655,
  "onggija": 656,
  "grapenga": 657,
  "changsao": 658,
  "budepa": 659,
  "butchuma": 660,
  "measarang": 661,
  "mechiksarang": 662,
  "measa": 663,
  "mechiksa": 664,
  "gital": 665,
  "guiter": 666,
  "bajai.ga": 667,
  "sa": 668,
  "gni": 669,
  "gitam": 670,
  "bri": 671,
  "bonga": 672,
  "dok": 673,
  "sni": 674,
  "chet": 675,
  "sku": 676,
  "chikking": 677,
  "chisa": 678,
  "chigni": 679,
  "chigitam": 680,
  "chibri": 681,
  "chibonga": 682,
  "chidok": 683,
  "chisni": 684,
  "chichet": 685,
  "chisku": 686,
  "kolgrik": 687,
  "kolachi": 688,
  "sotbri": 689,
  "sotbonga": 690,
  "sotdok": 691,
  "sotsni": 692,
  "sotchet": 693,
  "sotsku": 694,
  "richasa": 695,
  "richagni": 696,
  "richagitam": 697,
  "richabri": 698,
  "richabonga": 699,
  "richadok": 700,
  "richasni": 701,
  "richachet": 702,
  "richasku": 703,
  "lakhsa": 704
}