{
  "<pad>": 0,
  "<bos>": 1,
  "<eos>": 2,
  "<unk>": 3,
  "abi": 4,
  "ongjok": 5,
  "aganchakani": 6,
  "anga": 7,
  "achak": 8,
  "cha.gen": 9,
  "agan": 10,
  "angna": 11,
  "mai": 12,
  "ong.achim": 13,
  "na.a": 14,
  "dak.enga": 15,
  "maiko": 16,
  "kal.enga": 17,
  "agana": 18,
  "aganchakani.ara": 19,
  "ong.en": 20,
  "aganjok": 21,
  "aiao": 22,
  "bibal": 23,
  "silade": 24,
  "!": 25,
  "am": 26,
  "name": 27,
  "knatimbo": 28,
  "ama": 29,
  "amak": 30,
  "ambi": 31,
  "amde": 32,
  "dongen": 33,
  "amm": 34,
  "jamano": 35,
  "golpogen": 36,
  "nangna": 37,
  "call": 38,
  "kagen": 39,
  "maming": 40,
  "ongja": 41,
  "masijok": 42,
  "nama": 43,
  "ammde": 44,
  "daoba": 45,
  "talatenga": 46,
  "anchiko": 47,
  "ni.atbo": 48,
  "anching": 49,
  "mi": 50,
  "cha.a": 51,
  "anchingna": 52,
  "ang.a": 53,
  "ia": 54,
  "film": 55,
  "ko": 56,
  "nia": 57,
  "mija": 58,
  "antio": 59,
  "ang.ke": 60,
  "a.palo": 61,
  "achako": 62,
  "agan.enga": 63,
  "aro": 64,
  "knatima": 65,
  "antichi": 66,
  "re.angenga": 67,
  "apalchi": 68,
  "arataha": 69,
  "bajalo": 70,
  "bajalona": 71,
  "basakoba": 72,
  "re.bagen": 73,
  "bi.sarangming": 74,
  "kal.a": 75,
  "bilsi": 76,
  "chiking": 77,
  "bol": 78,
  "pang": 79,
  "dao": 80,
  "tusia": 81,
  "chatro": 82,
  "chi": 83,
  "ringa": 84,
  "chitti": 85,
  "sea": 86,
  "chrok.enga": 87,
  "da.al": 88,
  "walo": 89,
  "ki.tap": 90,
  "poraigen": 91,
  "cha.enga": 92,
  "kam": 93,
  "ka.enga": 94,
  "do.o": 95,
  "cha.ana": 96,
  "sikbe.engjok": 97,
  "do.oko": 98,
  "nika": 99,
  "festivalo": 100,
  "chroka": 101,
  "garo": 102,
  "hillo": 103,
  "donga": 104,
  "git": 105,
  "ringen": 106,
  "kinalo": 107,
  "biapo": 108,
  "dong.a": 109,
  "iano": 110,
  "na": 111,
  "re.baa": 112,
  "maikoba": 113,
  "brena": 114,
  "ru.ta": 115,
  "somoionin": 116,
  "dong.enga": 117,
  "sakoba": 118,
  "grongna": 119,
  "reba": 120,
  "ja.man": 121,
  "no": 122,
  "jro.enga": 123,
  "ka.dinga": 124,
  "grapa": 125,
  "kaam": 126,
  "kalgen": 127,
  "ka.a": 128,
  "neng.taka": 129,
  "kammo": 130,
  "kat.enga": 131,
  "kata": 132,
  "kusi": 133,
  "ong.a": 134,
  "poraia": 135,
  "chiti": 136,
  "chokgen": 137,
  "chrokgen": 138,
  "katgen": 139,
  "kna.a": 140,
  "kna.enga": 141,
  "nanga": 142,
  "mamingba": 143,
  "dakja.enga": 144,
  "mande": 145,
  "masija": 146,
  "iako": 147,
  "me.su": 148,
  "samjakrangko": 149,
  "meghalayao": 150,
  "songdonga": 151,
  "cha": 152,
  "enga": 153,
  "miakoba": 154,
  "ramramgipako": 155,
  "mijal": 156,
  "seaha": 157,
  "poraiaha": 158,
  "mijalo": 159,
  "kal.aha": 160,
  "schoolchi": 161,
  "rama": 162,
  "re.angaha": 163,
  "mirongko": 164,
  "nangko": 165,
  "ka.sa": 166,
  "neng.take": 167,
  "ni.enga": 168,
  "nokchi": 169,
  "re.anga": 170,
  "noko": 171,
  "noksa": 172,
  "sal.enga": 173,
  "okrienga": 174,
  "ontisa": 175,
  "somoioni": 176,
  "porai.enga": 177,
  "re.a": 178,
  "re.enga": 179,
  "ring.enga": 180,
  "rongchi": 181,
  "rongtalat.enga": 182,
  "sawa": 183,
  "schoolona": 184,
  "sea.enga": 185,
  "sengso.enga": 186,
  "skie": 187,
  "ra.enga": 188,
  "skigipa": 189,
  "song.enga": 190,
  "ta.rake": 191,
  "ta.raken": 192,
  "re.bapilgen": 193,
  "tale": 194,
  "agangen": 195,
  "tusi.enga": 196,
  "tusigen": 197,
  "tusina": 198,
  "tv": 199,
  "nie": 200,
  "ming": 201,
  "walni": 202,
  "ringaha": 203,
  "angaba": 204,
  "namenga": 205,
  "angade": 206,
  "kramchi": 207,
  "rarajok": 208,
  "angchina": 209,
  "nibo": 210,
  "angko": 211,
  "dak.chakanina": 212,
  "mitela": 213,
  "dakchakbo": 214,
  "kema": 215,
  "ka.bo": 216,
  "ka.pabo": 217,
  "rohit": 218,
  "minga": 219,
  "kabo": 220,
  "re.bajoko": 221,
  "dakchakna": 222,
  "mangenma": 223,
  "namen": 224,
  "khashabo": 225,
  "nangja": 226,
  "onbo": 227,
  "angni": 228,
  "biming": 229,
  "marak": 230,
  "biminga": 231,
  "bokma": 232,
  "mikuengjok": 233,
  "okrieming": 234,
  "botol": 235,
  "angnin": 236,
  "gualani": 237,
  "ango": 238,
  "ka.ani": 239,
  "nengnikani": 240,
  "asong": 241,
  "asong.enga": 242,
  "asongbo": 243,
  "atchiata": 244,
  "atchu": 245,
  "attamnam": 246,
  "awang": 247,
  "baba": 248,
  "bachi": 249,
  "maidake": 250,
  "doarang": 251,
  "bilang.enga": 252,
  "?": 253,
  "bachina": 254,
  "chiringni": 255,
  "joka.enga": 256,
  "badia": 257,
  "bite": 258,
  "chibata": 259,
  "rubata": 260,
  "poraienga": 261,
  "ki.tapko": 262,
  "nangni": 263,
  "badita": 264,
  "badiya": 265,
  "golpo": 266,
  "baita": 267,
  "cha.ani": 268,
  "dongku.enga": 269,
  "nokrang": 270,
  "songadamo": 271,
  "bajal": 272,
  "bakos": 273,
  "ning.ao": 274,
  "banga": 275,
  "bano": 276,
  "basako": 277,
  "chagen": 278,
  "bisarang": 279,
  "jajong": 280,
  "nadogen": 281,
  "kadinga": 282,
  "basakoni": 283,
  "bia": 284,
  "apple": 285,
  "cha.aha": 286,
  "bus": 287,
  "o": 288,
  "reba.a": 289,
  "chamanjok": 290,
  "walgimik": 291,
  "tua": 292,
  "bigil": 293,
  "bisong": 294,
  "olakiramchi": 295,
  ".": 296,
  "cha.ha": 297,
  "chabi": 298,
  "chabo": 299,
  "chakat": 300,
  "chakatbo": 301,
  "chakatjok": 302,
  "chinga": 303,
  "chingna": 304,
  "chingo": 305,
  "chona": 306,
  "chongipa": 307,
  "dada": 308,
  "daka": 309,
  "dakenga": 310,
  "dal.a": 311,
  "dalgipa": 312,
  "dambe": 313,
  "me.chik": 314,
  "pante": 315,
  "tai": 316,
  "talatbo": 317,
  "daon": 318,
  "dakat": 319,
  "de": 320,
  "bye": 321,
  "dongbo": 322,
  "dingbea": 323,
  "da.asalde": 324,
  "do.bok": 325,
  "gada": 326,
  "gen": 327,
  "gingting": 328,
  "gitok": 329,
  "gondu": 330,
  "gora": 331,
  "hai": 332,
  "apsan": 333,
  "re.na": 334,
  "indide": 335,
  "hey": 336,
  "hi": 337,
  "hoe": 338,
  "busy": 339,
  "cha.jok": 340,
  "mangenba": 341,
  "katta": 342,
  "knae": 343,
  "ihing": 344,
  "masijaha": 345,
  "manjawa": 346,
  "kakuja": 347,
  "namja": 348,
  "indiba": 349,
  "indita": 350,
  "ja.a": 351,
  "ja.ping": 352,
  "ja.sku": 353,
  "dema": 354,
  "jachok": 355,
  "jajrengnabe": 356,
  "jak": 357,
  "jakpa": 358,
  "jakpong": 359,
  "jaksi": 360,
  "jaksirang": 361,
  "jakskil": 362,
  "nangming": 363,
  "janggil": 364,
  "jegita": 365,
  "jisuna": 366,
  "rasong": 367,
  "jojong": 368,
  "jumang": 369,
  "ka.bak": 370,
  "ka.saenga": 371,
  "ka.sapae": 372,
  "ianona": 373,
  "re.babo": 374,
  "kang.kare": 375,
  "kasapae": 376,
  "kasine": 377,
  "khuliaha": 378,
  "khulibo": 379,
  "khuligen": 380,
  "ki.sangchi": 381,
  "ki.singkop": 382,
  "nigen": 383,
  "re.angen": 384,
  "kni": 385,
  "ku.chil": 386,
  "ku.dipe": 387,
  "ku.sik": 388,
  "ku.simang": 389,
  "ma.a": 390,
  "paa": 391,
  "rang": 392,
  "neng.nikani": 393,
  "ong.enga": 394,
  "classroomo": 395,
  "somoi": 396,
  "ongenga": 397,
  "doa": 398,
  "somoio": 399,
  "sal": 400,
  "napgen": 401,
  "maia": 402,
  "maina": 403,
  "cha.na": 404,
  "man.a": 405,
  "uamang": 406,
  "lekao": 407,
  "chokga": 408,
  "chanchi.enga": 409,
  "miksonga": 410,
  "askirang": 411,
  "ching.enga": 412,
  "mango": 413,
  "tusienga": 414,
  "mama": 415,
  "man.gen": 416,
  "mani": 417,
  "marong": 418,
  "masia": 419,
  "masu": 420,
  "matcha": 421,
  "matchapeng": 422,
  "matchok": 423,
  "matchu": 424,
  "dobok": 425,
  "matma": 426,
  "menggo": 427,
  "mengotchi": 428,
  "mes": 429,
  "kataha": 430,
  "mikkang": 431,
  "mikron": 432,
  "miksram": 433,
  "mongma": 434,
  "n.a": 435,
  "a": 436,
  "batchi": 437,
  "re": 438,
  "amenga": 439,
  "dakgen": 440,
  "man": 441,
  "genma": 442,
  "masiama": 443,
  "senggen": 444,
  "ma": 445,
  "bisarangming": 446,
  "ka.la": 447,
  "angana": 448,
  "man.ama": 449,
  "iachi": 450,
  "rebabo": 451,
  "sal.a": 452,
  "miksonge": 453,
  "aganenga": 454,
  "masiaha": 455,
  "chajokma": 456,
  "pen": 457,
  "on.a": 458,
  "rake": 459,
  "re.baengama": 460,
  "rebagen": 461,
  "rebana": 462,
  "mangen": 463,
  "sigen": 464,
  "uachi": 465,
  "na.aba": 466,
  "ang": 467,
  "baksa": 468,
  "repagenma": 469,
  "na.ara": 470,
  "janggi": 471,
  "tang.ao": 472,
  "kamko": 473,
  "ka.na": 474,
  "namengama": 475,
  "nachil": 476,
  "dake": 477,
  "poraibo": 478,
  "poariabo": 479,
  "namengaba": 480,
  ",": 481,
  "nang": 482,
  "babani": 483,
  "bimingko": 484,
  "namnikgipa": 485,
  "rong.ara": 486,
  "mai.a": 487,
  "gronge": 488,
  "namnik.aha": 489,
  "mitelbejok": 490,
  "namgipa": 491,
  "ong.china": 492,
  "nangnin": 493,
  "nok": 494,
  "nono": 495,
  "oh": 496,
  "olakiram": 497,
  "free": 498,
  "pringnam": 499,
  "ra": 500,
  "rabo": 501,
  "raka": 502,
  "rea": 503,
  "re.ang": 504,
  "reba.aha": 505,
  "rebo": 506,
  "ringbo": 507,
  "rimchaksoa": 508,
  "ripeng": 509,
  "ripengrang": 510,
  "ro.ong": 511,
  "ru.enga": 512,
  "rua": 513,
  "saljatchi": 514,
  "nam": 515,
  "salnam": 516,
  "sani": 517,
  "juttarang": 518,
  "angara": 519,
  "reba.enga": 520,
  "chairo": 521,
  "asongenga": 522,
  "sengbo": 523,
  "silchidare": 524,
  "ska": 525,
  "so.oma": 526,
  "song.a": 527,
  "sre": 528,
  "talat": 529,
  "teka": 530,
  "tusibo": 531,
  "re.angbo": 532,
  "ua": 533,
  "uko": 534,
  "rae": 535,
  "iyangbo": 536,
  "wagam": 537,
  "wak": 538,
  "walnam": 539,
  "songbad": 540,
  "gitrang": 541,
  "mipring": 542,
  "office": 543,
  "songa": 544,
  "english": 545,
  "ra.a": 546,
  "hindi": 547,
  "te.gatchu": 548,
  "namnika": 549,
  "ugitan": 550,
  "namenika": 551,
  "epil": 552,
  "terik": 553,
  "draka": 554,
  "narang": 555,
  "kompiram": 556,
  "robol": 557,
  "hockey": 558,
  "badminton": 559,
  "kal.inga": 560,
  "volleyball": 561,
  "kabaddi": 562,
  "basketball": 563,
  "ki.taprang": 564,
  "poedo": 565,
  "segipa": 566,
  "porai.ga": 567,
  "poraia.ga": 568,
  "novels": 569,
  "megazines": 570,
  "articles": 571,
  "homework": 572,
  "sea.ga": 573,
  "notes": 574,
  "essay": 575,
  "reports": 576,
  "assignments": 577,
  "project": 578,
  "ku.agana": 579,
  "gam.bea": 580,
  "gam.bee": 581,
  "aganinga": 582,
  "rinoke": 583,
  "ku.aganinga": 584,
  "rongtala": 585,
  "rongtale": 586,
  "ka.sae": 587,
  "bike": 588,
  "gari": 589,
  "kolom": 590,
  "hajok": 591,
  "ianon": 592,
  "seng.enga": 593,
  "okam": 594,
  "okamatjok": 595,
  "okam.enga": 596,
  "biko": 597,
  "matchota": 598,
  "matchotatjok": 599,
  "bon.ata": 600,
  "bon.atjok": 601,
  "kobor": 602,
  "knaaha": 603,
  "ra.jok": 604,
  "tangka": 605,
  "nikaha": 606,
  "sakgni": 607,
  "delhi": 608,
  "sokba.aha": 609,
  "sokbaa": 610,
  "skanga": 611,
  "grongaha": 612,
  "gronga": 613,
  "matchotataha": 614,
  "ra.aha": 615,
  "sokang.aha": 616,
  "phoneko": 617,
  "charge": 618,
  "ka.aha": 619,
  "homeworkko": 620,
  "bino": 621,
  "uamango": 622,
  "mirong": 623,
  "nokdang": 624,
  "jakra": 625,
  "jakgasi": 626,
  "kosak": 627,
  "kama": 628,
  "mikang": 629,
  "kisang": 630,
  "mitchia": 631,
  "gisik": 632,
  "skang": 633,
  "kae": 634,
  "ha": 635,
  "jaman": 636,
  "re.angno": 637,
  "reba.gen": 638,
  "bini": 639,
  "uamangni": 640,
  "darangoba": 641,
  "kadongja": 642,
  "nitat.enga": 643,
  "nitat.a": 644,
  "saloba": 645,
  "golpojawa": 646,
  "golpowa": 647,
  "jamani": 648,
  "sikkimgen": 649,
  "uchi": 650,
  "rena": 651,
  "onggija": 652,
  "chanchienga": 653,
  "grapenga": 654,
  "changsao": 655,
  "budepa": 656,
  "butchuma": 657,
  "measarang": 658,
  "mechiksarang": 659,
  "measa": 660,
  "mechiksa": 661,
  "gital": 662,
  "guiter": 663,
  "bajai.ga": 664,
  "sa": 665,
  "gni": 666,
  "gitam": 667,
  "bri": 668,
  "bonga": 669,
  "dok": 670,
  "sni": 671,
  "chet": 672,
  "sku": 673,
  "chisa": 674,
  "chigni": 675,
  "chigitam": 676,
  "chibri": 677,
  "chibonga": 678,
  "chidok": 679,
  "chisni": 680,
  "chichet": 681,
  "chisku": 682,
  "kolgrik": 683,
  "kolachi": 684,
  "sotbri": 685,
  "sotbonga": 686,
  "sotdok": 687,
  "sotsni": 688,
  "sotchet": 689,
  "sotsku": 690,
  "richasa": 691,
  "richagni": 692,
  "richagitam": 693,
  "richabri": 694,
  "richabonga": 695,
  "richadok": 696,
  "richasni": 697,
  "richachet": 698,
  "richasku": 699,
  "hajalsa": 700,
  "hajal": 701,
  "hajalgni": 702,
  "hajalgitam": 703,
  "hajalbri": 704,
  "hajalbonga": 705,
  "hajaldok": 706,
  "hajalsni": 707,
  "hajalchet": 708,
  "hajalsku": 709,
  "lakhsa": 710,
  "saenga": 711,
  "tekjok": 712,
  "duk": 713,
  "onga": 714,
  "kadingenga": 715,
  "katchae": 716,
  "roa": 717,
  "katcha": 718,
  "katchaenga": 719,
  "silbea": 720,
  "nitoa": 721,
  "nitobea": 722,
  "sila": 723,
  "bilaka": 724,
  "mea.sa": 725,
  "nokona": 726,
  "bi.sarangde": 727,
  "simbraengjokna": 728,
  "nang.na": 729,
  "roramenga": 730,
  "rorama": 731,
  "ma.sia": 732,
  "mamingko": 733,
  "ba": 734,
  "ma.sija": 735,
  "ong.ja": 736,
  "maiba": 737
}